[Killed] BlockStatement
http/controllers/employee/fetch-all.ts:7:3
 export async function fetchAllEmployees(
   request: FastifyRequest,
   reply: FastifyReply
-) {
-  try {
-    const fetchAllEmployeeService = makeFetchAllEmployeesService();
-
-    const { employee } = await fetchAllEmployeeService.execute();
-
-    return reply.status(200).send({ employee: employee });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
-}
+) {}
killedBy: fetchAllEmployees Controller should return all employees successfully
statusReason: expected "makeFetchAllEmployeesService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/employee/fetch-all.ts:8:7
   request: FastifyRequest,
   reply: FastifyReply
 ) {
-  try {
-    const fetchAllEmployeeService = makeFetchAllEmployeesService();
-
-    const { employee } = await fetchAllEmployeeService.execute();
-
-    return reply.status(200).send({ employee: employee });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return reply.status(500).send({ message: "Internal Server Error" });
killedBy: fetchAllEmployees Controller should return all employees successfully
statusReason: expected "makeFetchAllEmployeesService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/employee/fetch-all.ts:14:19
     const { employee } = await fetchAllEmployeeService.execute();
 
     return reply.status(200).send({ employee: employee });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
killedBy: fetchAllEmployees Controller should handle service errors and return 500
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0

[Killed] StringLiteral
http/controllers/employee/fetch-all.ts:16:46
     return reply.status(200).send({ employee: employee });
   } catch (error) {
     console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
+    return reply.status(500).send({ message: "" });
   }
 }
killedBy: fetchAllEmployees Controller should handle service errors and return 500
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {
