[Killed] BlockStatement
http/controllers/user/authenticate.ts:39:19
         token
       })
 
-  } catch (error) {
-      if (error instanceof InvalidCredentialError) {
-          return reply.status(400).send({ message: error.message })
-      }
-
-      throw error
-  }
+  } catch (error) {}
 }
killedBy: authenticateUser Controller should return 400 for InvalidCredentialError
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/user/authenticate.ts:40:11
       })
 
   } catch (error) {
-      if (error instanceof InvalidCredentialError) {
+      if (false) {
           return reply.status(400).send({ message: error.message })
       }
killedBy: authenticateUser Controller should return 400 for InvalidCredentialError
statusReason: Invalid credentials.

[Killed] BlockStatement
http/controllers/user/authenticate.ts:40:52
       })
 
   } catch (error) {
-      if (error instanceof InvalidCredentialError) {
-          return reply.status(400).send({ message: error.message })
-      }
+      if (error instanceof InvalidCredentialError) {}
 
       throw error
killedBy: authenticateUser Controller should return 400 for InvalidCredentialError
statusReason: Invalid credentials.
