[Killed] BlockStatement
src/services/user/user-authenticate.ts:20:112
       private userRepository: UserRepository
   ) {}
 
-  async execute({ email, password }: UserAuthenticateServiceRequest): Promise<UserAuthenticateServiceResponse> {
-      const user = await this.userRepository.findByEmail(email)
-
-      if (!user) {
-          throw new InvalidCredentialError()
-      }
-
-      const doesPasswordMatches = await compare(password, user.password_hash)
-
-      if (!doesPasswordMatches) {
-          throw new InvalidCredentialError()
-      }
-
-      return {
-          user,
-      }
-  }
+  async execute({ email, password }: UserAuthenticateServiceRequest): Promise<UserAuthenticateServiceResponse> {}
 }
killedBy: UserAuthenticateService execute should authenticate user successfully with correct credentials
statusReason: expected "spy" to be called 1 times, but got 0 times
