[Killed] ObjectLiteral
http/controllers/employee/create.ts:10:41
   request: FastifyRequest,
   reply: FastifyReply
 ) {
-  const createEmployeeSchema = z.object({
-    name: z.string(),
-    email: z.string().email(),
-    password: z.string().min(6)
-  });
+  const createEmployeeSchema = z.object({});
 
   const { name, email, password } = createEmployeeSchema.parse(request.body);
killedBy: createEmployee Controller should create an employee successfully
statusReason: expected "spy" to be called with arguments: [ { name: 'John Doe', …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] MethodExpression
http/controllers/employee/create.ts:13:15
   const createEmployeeSchema = z.object({
     name: z.string(),
     email: z.string().email(),
-    password: z.string().min(6)
+    password: z.string().max(6)
   });
 
killedBy: createEmployee Controller should throw error when password is too short
statusReason: promise resolved "{ status: [Function spy], …(1) }" instead of rejecting

[Killed] BlockStatement
http/controllers/employee/create.ts:18:7
 
   const { name, email, password } = createEmployeeSchema.parse(request.body);
 
-  try {
-    const createEmployeeService = makeCreateEmployeeService();
-
-    await createEmployeeService.execute({
-      name,
-      email,
-      password
-    });
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof UserAlreadyExistsError) {
       return reply.status(409).send({ message: error.message });
killedBy: createEmployee Controller should create an employee successfully
statusReason: expected "makeCreateEmployeeService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/employee/create.ts:26:19
       email,
       password
     });
-  } catch (error) {
-    if (error instanceof UserAlreadyExistsError) {
-      return reply.status(409).send({ message: error.message });
-    }
-
-    throw error;
-  }
+  } catch (error) {}
 
   return reply.status(201).send();
killedBy: createEmployee Controller should return 409 when user already exists
statusReason: expected "spy" to be called with arguments: [ 409 ]

Received: 

  1st spy call:

  Array [
-   409,

[Killed] ConditionalExpression
http/controllers/employee/create.ts:27:9
       password
     });
   } catch (error) {
-    if (error instanceof UserAlreadyExistsError) {
+    if (false) {
       return reply.status(409).send({ message: error.message });
     }
killedBy: createEmployee Controller should return 409 when user already exists
statusReason: E-mail already exists.

[Killed] ConditionalExpression
http/controllers/employee/create.ts:27:9
       password
     });
   } catch (error) {
-    if (error instanceof UserAlreadyExistsError) {
+    if (true) {
       return reply.status(409).send({ message: error.message });
     }
killedBy: createEmployee Controller should rethrow unexpected errors
statusReason: promise resolved "{ status: [Function spy], …(1) }" instead of rejecting

[Killed] ObjectLiteral
http/controllers/employee/create.ts:28:37
     });
   } catch (error) {
     if (error instanceof UserAlreadyExistsError) {
-      return reply.status(409).send({ message: error.message });
+      return reply.status(409).send({});
     }
 
killedBy: createEmployee Controller should return 409 when user already exists
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
