[Killed] BlockStatement
http/controllers/employee/find-by-id.ts:9:3
 export async function findEmployeeById(
   request: FastifyRequest,
   reply: FastifyReply
-) {
-  const findEmployeeByIdSchema = z.object({
-    id: z.string(),
-  });
-
-  try {
-    const { id } = findEmployeeByIdSchema.parse(request.params);
-
-    const fetchEmployeeByIdService = makeFindEmployeeByIdService();
-
-    const { employee } = await fetchEmployeeByIdService.execute({ id });
-
-    return reply.status(200).send({ employee });
-  } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
-
-    throw error;
-  }
-}
+) {}
killedBy: findEmployeeById Controller should find an employee by id successfully
statusReason: expected "makeFindEmployeeByIdService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/employee/find-by-id.ts:10:43
   request: FastifyRequest,
   reply: FastifyReply
 ) {
-  const findEmployeeByIdSchema = z.object({
-    id: z.string(),
-  });
+  const findEmployeeByIdSchema = z.object({});
 
   try {
killedBy: findEmployeeById Controller should find an employee by id successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/employee/find-by-id.ts:14:7
     id: z.string(),
   });
 
-  try {
-    const { id } = findEmployeeByIdSchema.parse(request.params);
-
-    const fetchEmployeeByIdService = makeFindEmployeeByIdService();
-
-    const { employee } = await fetchEmployeeByIdService.execute({ id });
-
-    return reply.status(200).send({ employee });
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof NoRecordsFoundError) {
       return reply.status(404).send({ message: error.message });
killedBy: findEmployeeById Controller should find an employee by id successfully
statusReason: expected "makeFindEmployeeByIdService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/employee/find-by-id.ts:22:19
     const { employee } = await fetchEmployeeByIdService.execute({ id });
 
     return reply.status(200).send({ employee });
-  } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
-
-    throw error;
-  }
+  } catch (error) {}
 }
killedBy: findEmployeeById Controller should return 404 when employee is not found
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/employee/find-by-id.ts:23:9
 
     return reply.status(200).send({ employee });
   } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
+    if (true) {
       return reply.status(404).send({ message: error.message });
     }
killedBy: findEmployeeById Controller should throw ZodError when id is missing in params
statusReason: promise resolved "{ status: [Function spy], …(1) }" instead of rejecting

[Killed] BlockStatement
http/controllers/employee/find-by-id.ts:23:47
 
     return reply.status(200).send({ employee });
   } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
+    if (error instanceof NoRecordsFoundError) {}
 
     throw error;
killedBy: findEmployeeById Controller should return 404 when employee is not found
statusReason: No records found.

[Killed] ObjectLiteral
http/controllers/employee/find-by-id.ts:24:37
     return reply.status(200).send({ employee });
   } catch (error) {
     if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
+      return reply.status(404).send({});
     }
 
killedBy: findEmployeeById Controller should return 404 when employee is not found
statusReason: expected "spy" to be called with arguments: [ { message: 'No records found.' } ]

Received: 

  1st spy call:

  Array [
-   Object {
