[Killed] MethodExpression
http/controllers/employee/update.ts:13:15
     userId: z.string(),
     name: z.string(),
     email: z.string().email(),
-    password: z.string().min(6).optional(),
+    password: z.string().max(6).optional(),
   });
 
killedBy: updateEmployee Controller should update an employee successfully with all fields
statusReason: expected "makeUpdateEmployeeService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/employee/update.ts:16:7
     password: z.string().min(6).optional(),
   });
 
-  try {
-    const { userId, name, email, password } = updateEmployeeBodySchema.parse(
-      request.body
-    );
-
-    const updateEmployeeService = makeUpdateEmployeeService();
-
-    await updateEmployeeService.execute({
-      userId,
-      name,
-      email,
-      password,
-    });
-
-    return reply.status(200).send({ message: "Employee successfully updated." });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return reply.status(500).send({ message: "Internal Server Error" });
killedBy: updateEmployee Controller should update an employee successfully with all fields
statusReason: expected "makeUpdateEmployeeService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/employee/update.ts:30:35
       password,
     });
 
-    return reply.status(200).send({ message: "Employee successfully updated." });
+    return reply.status(200).send({});
   } catch (error) {
     console.error(error);
killedBy: updateEmployee Controller should update an employee successfully with all fields
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] StringLiteral
http/controllers/employee/update.ts:30:46
       password,
     });
 
-    return reply.status(200).send({ message: "Employee successfully updated." });
+    return reply.status(200).send({ message: "" });
   } catch (error) {
     console.error(error);
killedBy: updateEmployee Controller should update an employee successfully with all fields
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/employee/update.ts:31:19
     });
 
     return reply.status(200).send({ message: "Employee successfully updated." });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
killedBy: updateEmployee Controller should return 500 when validation fails with missing required fields
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/employee/update.ts:33:35
     return reply.status(200).send({ message: "Employee successfully updated." });
   } catch (error) {
     console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
+    return reply.status(500).send({});
   }
 }
killedBy: updateEmployee Controller should return 500 when validation fails with missing required fields
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
