[Killed] BlockStatement
http/controllers/manager/create.ts:18:7
 
   const { name, email, password } = createManagerSchema.parse(request.body);
 
-  try {
-    const createManagerService = makeCreateManagerService();
-
-    await createManagerService.execute({
-      name,
-      email,
-      password
-    });
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof UserAlreadyExistsError) {
       return reply.status(409).send({ message: error.message });
killedBy: createManager Controller should create a manager successfully
statusReason: expected "makeCreateManagerService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/manager/create.ts:21:40
   try {
     const createManagerService = makeCreateManagerService();
 
-    await createManagerService.execute({
-      name,
-      email,
-      password
-    });
+    await createManagerService.execute({});
   } catch (error) {
     if (error instanceof UserAlreadyExistsError) {
killedBy: createManager Controller should create a manager successfully
statusReason: expected "spy" to be called with arguments: [ { name: 'John Manager', …(2) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/manager/create.ts:27:50
       password
     });
   } catch (error) {
-    if (error instanceof UserAlreadyExistsError) {
-      return reply.status(409).send({ message: error.message });
-    }
+    if (error instanceof UserAlreadyExistsError) {}
 
     throw error;
killedBy: createManager Controller should return 409 when user already exists
statusReason: E-mail already exists.
