[Killed] BlockStatement
http/controllers/manager/fetch-all.ts:7:3
 export async function fetchAllManagers(
   request: FastifyRequest,
   reply: FastifyReply
-) {
-  try {
-    const fetchAllManagerService = makeFetchAllManagersService();
-
-    const { managers } = await fetchAllManagerService.execute();
-
-    return reply.status(200).send({ managers: managers });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
-}
+) {}
killedBy: fetchAllManagers Controller should return all managers successfully
statusReason: expected "makeFetchAllManagersService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/manager/fetch-all.ts:8:7
   request: FastifyRequest,
   reply: FastifyReply
 ) {
-  try {
-    const fetchAllManagerService = makeFetchAllManagersService();
-
-    const { managers } = await fetchAllManagerService.execute();
-
-    return reply.status(200).send({ managers: managers });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return reply.status(500).send({ message: "Internal Server Error" });
killedBy: fetchAllManagers Controller should return all managers successfully
statusReason: expected "makeFetchAllManagersService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/manager/fetch-all.ts:14:19
     const { managers } = await fetchAllManagerService.execute();
 
     return reply.status(200).send({ managers: managers });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
killedBy: fetchAllManagers Controller should handle service errors and return 500
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0
