[Killed] BlockStatement
http/controllers/manager/find-by-id.ts:9:3
 export async function findManagerById(
   request: FastifyRequest,
   reply: FastifyReply
-) {
-  const findManagerByIdSchema = z.object({
-    id: z.string(),
-  });
-
-  try {
-    const { id } = findManagerByIdSchema.parse(request.params);
-
-    const fetchManagerByIdService = makeFindManagerByIdService();
-
-    const { manager } = await fetchManagerByIdService.execute({ id });
-
-    return reply.status(200).send({ manager });
-  } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
-
-    throw error;
-  }
-}
+) {}
killedBy: findManagerById Controller should find a manager by id successfully
statusReason: expected "makeFindManagerByIdService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/manager/find-by-id.ts:14:7
     id: z.string(),
   });
 
-  try {
-    const { id } = findManagerByIdSchema.parse(request.params);
-
-    const fetchManagerByIdService = makeFindManagerByIdService();
-
-    const { manager } = await fetchManagerByIdService.execute({ id });
-
-    return reply.status(200).send({ manager });
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof NoRecordsFoundError) {
       return reply.status(404).send({ message: error.message });
killedBy: findManagerById Controller should find a manager by id successfully
statusReason: expected "makeFindManagerByIdService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/manager/find-by-id.ts:19:63
 
     const fetchManagerByIdService = makeFindManagerByIdService();
 
-    const { manager } = await fetchManagerByIdService.execute({ id });
+    const { manager } = await fetchManagerByIdService.execute({});
 
     return reply.status(200).send({ manager });
killedBy: findManagerById Controller should find a manager by id successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] ObjectLiteral
http/controllers/manager/find-by-id.ts:21:35
 
     const { manager } = await fetchManagerByIdService.execute({ id });
 
-    return reply.status(200).send({ manager });
+    return reply.status(200).send({});
   } catch (error) {
     if (error instanceof NoRecordsFoundError) {
killedBy: findManagerById Controller should find a manager by id successfully
statusReason: expected "spy" to be called with arguments: [ { manager: { …(5) } } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/manager/find-by-id.ts:22:19
     const { manager } = await fetchManagerByIdService.execute({ id });
 
     return reply.status(200).send({ manager });
-  } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
-
-    throw error;
-  }
+  } catch (error) {}
 }
killedBy: findManagerById Controller should return 404 when manager is not found
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/manager/find-by-id.ts:23:9
 
     return reply.status(200).send({ manager });
   } catch (error) {
-    if (error instanceof NoRecordsFoundError) {
+    if (false) {
       return reply.status(404).send({ message: error.message });
     }
killedBy: findManagerById Controller should return 404 when manager is not found
statusReason: No records found.
