[Killed] BlockStatement
http/controllers/manager/update.ts:16:7
     password: z.string().min(6).optional(),
   });
 
-  try {
-    const { userId, name, email, password } = updateManagerBodySchema.parse(
-      request.body
-    );
-
-    const updateManagerService = makeUpdateManagerService();
-
-    await updateManagerService.execute({
-      userId,
-      name,
-      email,
-      password,
-    });
-
-    return reply.status(200).send({ message: "Manager successfully updated." });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return reply.status(500).send({ message: "Internal Server Error" });
killedBy: updateManager Controller should update a manager successfully with all fields
statusReason: expected "makeUpdateManagerService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/manager/update.ts:31:19
     });
 
     return reply.status(200).send({ message: "Manager successfully updated." });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
killedBy: updateManager Controller should return 500 when validation fails with missing required fields
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0
