[Killed] MethodExpression
http/controllers/product/create.ts:17:19
 
     const CreateProductService = makeCreateProductService();
 
-    const batch = Math.random().toString(36).substring(2, 8).toUpperCase();
+    const batch = Math.random().toString(36).toUpperCase();
 
     const { product } = await CreateProductService.handle({
killedBy: createProduct Controller - Edge Cases should generate a batch code with correct format
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] MethodExpression
http/controllers/product/create.ts:17:19
 
     const CreateProductService = makeCreateProductService();
 
-    const batch = Math.random().toString(36).substring(2, 8).toUpperCase();
+    const batch = Math.random().toString(36).substring(2, 8).toLowerCase();
 
     const { product } = await CreateProductService.handle({
killedBy: createProduct Controller - Edge Cases should generate a batch code with correct format
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {
