[Killed] BlockStatement
http/controllers/product/fetch-all.ts:4:85
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllProductService } from "../../../services/factories/product/make-fetch-all-product-service";
 
-export async function fetchAllProduct(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllProductService = makeFetchAllProductService();
-
-    const { product } = await fetchAllProductService.execute();
-
-    reply.code(200).send({
-        product
-    });
-}
+export async function fetchAllProduct(request: FastifyRequest, reply: FastifyReply) {}
killedBy: fetchAllProduct Controller should return all products successfully
statusReason: expected "makeFetchAllProductService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/product/fetch-all.ts:9:26
 
     const { product } = await fetchAllProductService.execute();
 
-    reply.code(200).send({
-        product
-    });
+    reply.code(200).send({});
 }
killedBy: fetchAllProduct Controller should return all products successfully
statusReason: expected "spy" to be called with arguments: [ { product: [ …(2) ] } ]

Received: 

  1st spy call:

  Array [
-   Object {
