[Killed] BlockStatement
http/controllers/product/find-by-id.ts:6:85
 import { makeFindProductByIdService } from "../../../services/factories/product/make-find-product-by-id-service";
 import { NoRecordsFoundError } from "../../../services/errors/no-records-found-error";
 
-export async function findProductById(request: FastifyRequest, reply: FastifyReply) {
-    const findProductByIdSchema = z.object({
-        id: z.string(),
-    });
-
-    try {
-        const { id } = findProductByIdSchema.parse(request.params);
-
-        const findProductByIdService = makeFindProductByIdService();
-        
-        const { product } = await findProductByIdService.execute({ productId: id });
-
-        return reply.status(200).send({ product });
-    } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
-
-        throw error;
-    }
-}
+export async function findProductById(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: findProductById Controller should find a product by id successfully
statusReason: expected "makeFindProductByIdService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/product/find-by-id.ts:7:44
 import { NoRecordsFoundError } from "../../../services/errors/no-records-found-error";
 
 export async function findProductById(request: FastifyRequest, reply: FastifyReply) {
-    const findProductByIdSchema = z.object({
-        id: z.string(),
-    });
+    const findProductByIdSchema = z.object({});
 
     try {
killedBy: findProductById Controller should find a product by id successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/product/find-by-id.ts:11:9
         id: z.string(),
     });
 
-    try {
-        const { id } = findProductByIdSchema.parse(request.params);
-
-        const findProductByIdService = makeFindProductByIdService();
-        
-        const { product } = await findProductByIdService.execute({ productId: id });
-
-        return reply.status(200).send({ product });
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof NoRecordsFoundError) {
             return reply.status(404).send({ message: 'No records found.' });
killedBy: findProductById Controller should find a product by id successfully
statusReason: expected "makeFindProductByIdService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/product/find-by-id.ts:18:39
         
         const { product } = await findProductByIdService.execute({ productId: id });
 
-        return reply.status(200).send({ product });
+        return reply.status(200).send({});
     } catch (error) {
         if (error instanceof NoRecordsFoundError) {
killedBy: findProductById Controller should find a product by id successfully
statusReason: expected "spy" to be called with arguments: [ { product: { …(8) } } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/product/find-by-id.ts:19:21
         const { product } = await findProductByIdService.execute({ productId: id });
 
         return reply.status(200).send({ product });
-    } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
-
-        throw error;
-    }
+    } catch (error) {}
 }
 
killedBy: findProductById Controller should return 404 when product is not found
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] BlockStatement
http/controllers/product/find-by-id.ts:20:51
 
         return reply.status(200).send({ product });
     } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
+        if (error instanceof NoRecordsFoundError) {}
 
         throw error;
killedBy: findProductById Controller should return 404 when product is not found
statusReason: No records found.
