[Killed] BlockStatement
http/controllers/product/inactivate.ts:5:87
 import { makeInactivateProductService } from "../../../services/factories/product/make-inactivate-product-service";
 import { NoRecordsFoundError } from "../../../services/errors/no-records-found-error";
 
-export async function inactivateProduct(request: FastifyRequest, reply: FastifyReply) {
-    const inactivateProductService = makeInactivateProductService();
-
-    const { id } = request.params as { id: string };
-
-    try {
-        await inactivateProductService.execute({
-            productId: id
-        });
-
-        return reply.code(204).send();
-    } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
-
-        throw error;
-    }
-}
+export async function inactivateProduct(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: inactivateProduct Controller should inactivate a product successfully
statusReason: expected "makeInactivateProductService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/product/inactivate.ts:10:9
 
     const { id } = request.params as { id: string };
 
-    try {
-        await inactivateProductService.execute({
-            productId: id
-        });
-
-        return reply.code(204).send();
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof NoRecordsFoundError) {
             return reply.status(404).send({ message: 'No records found.' });
killedBy: inactivateProduct Controller should inactivate a product successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
http/controllers/product/inactivate.ts:16:21
         });
 
         return reply.code(204).send();
-    } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
-
-        throw error;
-    }
+    } catch (error) {}
 }
 
killedBy: inactivateProduct Controller should return 404 when product is not found
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/product/inactivate.ts:18:43
         return reply.code(204).send();
     } catch (error) {
         if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
+            return reply.status(404).send({});
         }
 
killedBy: inactivateProduct Controller should return 404 when product is not found
statusReason: expected "spy" to be called with arguments: [ { message: 'No records found.' } ]

Received: 

  1st spy call:

  Array [
-   Object {
