[Killed] BlockStatement
http/controllers/product/patch.ts:15:9
         batch: z.string().optional()
     });
 
-    try {
-        const { id } = request.params as { id: string };
-
-        const { name, description, price, quantity_in_stock, batch } = patchProductBodySchema.parse(request.body);
-
-        const patchProductService = makePatchProductService();
-
-        const { product } = await patchProductService.handle({
-            id,
-            data: {
-                name,
-                description,
-                price,
-                quantity_in_stock,
-                batch,
-            },
-        });
-
-        reply.code(200).send({
-            product,
-        });
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof NoRecordsFoundError) {
             return reply.status(404).send({ message: 'No records found.' });
killedBy: patchProduct Controller should patch a product successfully with all fields
statusReason: expected "makePatchProductService" to be called once, but got 0 times

[Killed] ObjectLiteral
http/controllers/product/patch.ts:22:62
 
         const patchProductService = makePatchProductService();
 
-        const { product } = await patchProductService.handle({
-            id,
-            data: {
-                name,
-                description,
-                price,
-                quantity_in_stock,
-                batch,
-            },
-        });
+        const { product } = await patchProductService.handle({});
 
         reply.code(200).send({
killedBy: patchProduct Controller should patch a product successfully with all fields
statusReason: expected "spy" to be called with arguments: [ { …(2) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] ObjectLiteral
http/controllers/product/patch.ts:33:30
             },
         });
 
-        reply.code(200).send({
-            product,
-        });
+        reply.code(200).send({});
     } catch (error) {
         if (error instanceof NoRecordsFoundError) {
killedBy: patchProduct Controller should patch a product successfully with all fields
statusReason: expected "spy" to be called with arguments: [ { product: { …(8) } } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/product/patch.ts:36:21
         reply.code(200).send({
             product,
         });
-    } catch (error) {
-        if (error instanceof NoRecordsFoundError) {
-            return reply.status(404).send({ message: 'No records found.' });
-        }
-
-        throw error;
-    }
+    } catch (error) {}
 }
 
killedBy: patchProduct Controller should return 404 when product is not found
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0
