[Killed] ObjectLiteral
http/controllers/purchase/create.ts:9:43
     request: FastifyRequest,
     reply: FastifyReply
 ) {
-    const createPurchaseSchema = z.object({
-        nf_number: z.string(),
-        supplierId: z.string(),
-        userId: z.string(),
-        items: z.array(
-            z.object({
-                productId: z.string(),
-                quantity: z.number(),
-                value: z.number(),
-            })
-        )
-    });
+    const createPurchaseSchema = z.object({});
 
     const { nf_number, supplierId, userId, items } = createPurchaseSchema.parse(request.body);
killedBy: createPurchase Controller should create a purchase successfully
statusReason: expected "spy" to be called with arguments: [ { nf_number: 'NF123456789', …(3) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/purchase/create.ts:24:9
 
     const { nf_number, supplierId, userId, items } = createPurchaseSchema.parse(request.body);
 
-    try {
-        const createPurchaseService = makeCreatePurchaseService();
-
-        await createPurchaseService.handle({
-            nf_number,
-            supplierId,
-            userId,
-            items
-        })
-    } catch (error) {
+    try {} catch (error) {
         throw error;
     }
killedBy: createPurchase Controller should create a purchase successfully
statusReason: expected "makeCreatePurchaseService" to be called once, but got 0 times

[Killed] BlockStatement
http/controllers/purchase/create.ts:33:21
             userId,
             items
         })
-    } catch (error) {
-        throw error;
-    }
+    } catch (error) {}
 
     return reply.status(201).send();
killedBy: createPurchase Controller should handle service errors
statusReason: promise resolved "{ status: [Function spy], …(1) }" instead of rejecting
