[Killed] BlockStatement
http/controllers/purchase/fetch-all-by-supplier-id.ts:4:98
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllPurchaseBySupplierIdService } from "../../../services/factories/purchase/make-fetch-all-purchase-by-supplier-id";
 
-export async function fetchAllPurchaseBySupplierId(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllPurchaseBySupplierIdService = makeFetchAllPurchaseBySupplierIdService();
-
-    const { supplierId } = request.params as { supplierId: string };
-
-    const { purchases } = await fetchAllPurchaseBySupplierIdService.execute({
-        supplierId
-    });
-
-    reply.code(200).send({
-        purchases
-    });
-}
+export async function fetchAllPurchaseBySupplierId(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchAllPurchaseBySupplierId Controller should return purchases for a valid supplier ID
statusReason: expected "makeFetchAllPurchaseBySupplierIdService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/purchase/fetch-all-by-supplier-id.ts:9:77
 
     const { supplierId } = request.params as { supplierId: string };
 
-    const { purchases } = await fetchAllPurchaseBySupplierIdService.execute({
-        supplierId
-    });
+    const { purchases } = await fetchAllPurchaseBySupplierIdService.execute({});
 
     reply.code(200).send({
killedBy: fetchAllPurchaseBySupplierId Controller should return purchases for a valid supplier ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] ObjectLiteral
http/controllers/purchase/fetch-all-by-supplier-id.ts:13:26
         supplierId
     });
 
-    reply.code(200).send({
-        purchases
-    });
+    reply.code(200).send({});
 }
 
killedBy: fetchAllPurchaseBySupplierId Controller should return purchases for a valid supplier ID
statusReason: expected "spy" to be called with arguments: [ { purchases: [ { …(7) }, …(1) ] } ]

Received: 

  1st spy call:

  Array [
-   Object {
