[Killed] BlockStatement
http/controllers/purchase/fetch-all-by-user-id.ts:4:94
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllPurchaseByUserIdService } from "../../../services/factories/purchase/make-fetch-all-purchase-by-user-id";
 
-export async function fetchAllPurchaseByUserId(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllPurchaseByUserIdService = makeFetchAllPurchaseByUserIdService();
-
-    const { userId } = request.params as { userId: string };
-
-    const { purchases } = await fetchAllPurchaseByUserIdService.execute({
-        userId
-    });
-
-    reply.code(200).send({
-        purchases
-    });
-}
+export async function fetchAllPurchaseByUserId(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchAllPurchaseByUserId Controller should return purchases for a valid user ID
statusReason: expected "makeFetchAllPurchaseByUserIdService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/purchase/fetch-all-by-user-id.ts:9:73
 
     const { userId } = request.params as { userId: string };
 
-    const { purchases } = await fetchAllPurchaseByUserIdService.execute({
-        userId
-    });
+    const { purchases } = await fetchAllPurchaseByUserIdService.execute({});
 
     reply.code(200).send({
killedBy: fetchAllPurchaseByUserId Controller should return purchases for a valid user ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
