[Killed] BlockStatement
http/controllers/purchase/fetch-all.ts:4:86
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllPurchaseService } from "../../../services/factories/purchase/make-fetch-all-purchase-service";
 
-export async function fetchAllPurchase(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllPurchaseService = makeFetchAllPurchaseService();
-
-    const { purchase } = await fetchAllPurchaseService.execute();
-
-    reply.code(200).send({
-        purchase
-    });
-}
+export async function fetchAllPurchase(request: FastifyRequest, reply: FastifyReply) {}
killedBy: fetchAllPurchase Controller should return all purchases successfully
statusReason: expected "makeFetchAllPurchaseService" to be called 1 times, but got 0 times
