[Killed] BlockStatement
http/controllers/purchase/find-by-id.ts:9:7
 
   const { id } = request.params as { id: string };
 
-  try {
-    const { purchase } = await findPurchaseByIdService.execute({
-      purchaseId: id,
-    });
-
-    reply.code(200).send({
-      purchase,
-    });
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof Error && error.message === 'Resource not found') {
       reply.code(404).send({
killedBy: findPurchaseById Controller should return purchase for a valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
http/controllers/purchase/find-by-id.ts:17:19
     reply.code(200).send({
       purchase,
     });
-  } catch (error) {
-    if (error instanceof Error && error.message === 'Resource not found') {
-      reply.code(404).send({
-        error: 'Not Found',
-        message: 'Resource not found',
-        statusCode: 404,
-      });
-    } else {
-      reply.code(500).send({
-        error: 'Internal Server Error',
-        message: 'An unexpected error occurred',
-        statusCode: 500,
-      });
-    }
-  }
+  } catch (error) {}
 }
 
killedBy: findPurchaseById Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/purchase/find-by-id.ts:18:9
       purchase,
     });
   } catch (error) {
-    if (error instanceof Error && error.message === 'Resource not found') {
+    if (true) {
       reply.code(404).send({
         error: 'Not Found',
killedBy: findPurchaseById Controller should handle NoRecordsFoundError with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 

  1st spy call:

  Array [
-   500,

[Killed] BlockStatement
http/controllers/purchase/find-by-id.ts:18:75
       purchase,
     });
   } catch (error) {
-    if (error instanceof Error && error.message === 'Resource not found') {
-      reply.code(404).send({
-        error: 'Not Found',
-        message: 'Resource not found',
-        statusCode: 404,
-      });
-    } else {
+    if (error instanceof Error && error.message === 'Resource not found') {} else {
       reply.code(500).send({
         error: 'Internal Server Error',
killedBy: findPurchaseById Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/purchase/find-by-id.ts:19:28
     });
   } catch (error) {
     if (error instanceof Error && error.message === 'Resource not found') {
-      reply.code(404).send({
-        error: 'Not Found',
-        message: 'Resource not found',
-        statusCode: 404,
-      });
+      reply.code(404).send({});
     } else {
       reply.code(500).send({
killedBy: findPurchaseById Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ { error: 'Not Found', …(2) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] StringLiteral
http/controllers/purchase/find-by-id.ts:20:16
   } catch (error) {
     if (error instanceof Error && error.message === 'Resource not found') {
       reply.code(404).send({
-        error: 'Not Found',
+        error: "",
         message: 'Resource not found',
         statusCode: 404,
killedBy: findPurchaseById Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ { error: 'Not Found', …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/purchase/find-by-id.ts:24:12
         message: 'Resource not found',
         statusCode: 404,
       });
-    } else {
-      reply.code(500).send({
-        error: 'Internal Server Error',
-        message: 'An unexpected error occurred',
-        statusCode: 500,
-      });
-    }
+    } else {}
   }
 }
killedBy: findPurchaseById Controller should handle NoRecordsFoundError with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/purchase/find-by-id.ts:25:28
         statusCode: 404,
       });
     } else {
-      reply.code(500).send({
-        error: 'Internal Server Error',
-        message: 'An unexpected error occurred',
-        statusCode: 500,
-      });
+      reply.code(500).send({});
     }
   }
killedBy: findPurchaseById Controller should handle NoRecordsFoundError with 500 response
statusReason: expected "spy" to be called with arguments: [ { …(3) } ]

Received: 

  1st spy call:

  Array [
-   Object {
