[Killed] ObjectLiteral
http/controllers/sale/create.ts:13:22
         nf_number: z.string(),
         userId: z.string(),
         items: z.array(
-            z.object({
-                productId: z.string(),
-                quantity: z.number(),
-                value: z.number(),
-            })
+            z.object({})
         )
     });
killedBy: createSale Controller should create a sale successfully with valid data
statusReason: expected "spy" to be called with arguments: [ { nf_number: 'NF123456', …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/sale/create.ts:21:9
         )
     });
 
-    try {
-        const { nf_number, userId, items } = createSaleSchema.parse(request.body);
-
-        const createSaleService = makeCreateSaleService();
-
-        await createSaleService.handle({
-            nf_number,
-            userId,
-            items
-        });
-
-        return reply.status(201).send();
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof z.ZodError) {
             return reply.status(400).send({ message: 'Invalid request payload' });
killedBy: createSale Controller should create a sale successfully with valid data
statusReason: expected "makeCreateSaleService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/sale/create.ts:33:21
         });
 
         return reply.status(201).send();
-    } catch (error) {
-        if (error instanceof z.ZodError) {
-            return reply.status(400).send({ message: 'Invalid request payload' });
-        }
-        console.error(error);
-        return reply.status(500).send({ message: 'Internal Server Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: createSale Controller should return 400 for invalid request payload (ZodError)
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/sale/create.ts:34:13
 
         return reply.status(201).send();
     } catch (error) {
-        if (error instanceof z.ZodError) {
+        if (true) {
             return reply.status(400).send({ message: 'Invalid request payload' });
         }
killedBy: createSale Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 

  1st spy call:

  Array [
-   500,

[Killed] ObjectLiteral
http/controllers/sale/create.ts:35:43
         return reply.status(201).send();
     } catch (error) {
         if (error instanceof z.ZodError) {
-            return reply.status(400).send({ message: 'Invalid request payload' });
+            return reply.status(400).send({});
         }
         console.error(error);
killedBy: createSale Controller should return 400 for invalid request payload (ZodError)
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] StringLiteral
http/controllers/sale/create.ts:38:50
             return reply.status(400).send({ message: 'Invalid request payload' });
         }
         console.error(error);
-        return reply.status(500).send({ message: 'Internal Server Error' });
+        return reply.status(500).send({ message: "" });
     }
 }
killedBy: createSale Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ObjectLiteral
http/controllers/sale/create.ts:38:39
             return reply.status(400).send({ message: 'Invalid request payload' });
         }
         console.error(error);
-        return reply.status(500).send({ message: 'Internal Server Error' });
+        return reply.status(500).send({});
     }
 }
killedBy: createSale Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
