[Killed] BlockStatement
http/controllers/sale/fetch-all-by-user-id.ts:4:90
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllSaleByUserIdService } from "../../../services/factories/sale/make-fetch-all-sale-by-user-id";
 
-export async function fetchAllSaleByUserId(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllSaleByUserIdService = makeFetchAllSaleByUserIdService();
-
-    const { userId } = request.params as { userId: string };
-
-    try {
-        const { sales } = await fetchAllSaleByUserIdService.execute({ userId });
-        return reply.code(200).send({ sales });
-    } catch (error) {
-        console.error(error); // Log the error for debugging purposes
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
-}
+export async function fetchAllSaleByUserId(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchAllSaleByUserId Controller should return sales for a valid user ID
statusReason: expected "makeFetchAllSaleByUserIdService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/sale/fetch-all-by-user-id.ts:9:9
 
     const { userId } = request.params as { userId: string };
 
-    try {
-        const { sales } = await fetchAllSaleByUserIdService.execute({ userId });
-        return reply.code(200).send({ sales });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error); // Log the error for debugging purposes
         return reply.code(500).send({ message: 'Internal Server Error' });
killedBy: fetchAllSaleByUserId Controller should return sales for a valid user ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/sale/fetch-all-by-user-id.ts:11:37
 
     try {
         const { sales } = await fetchAllSaleByUserIdService.execute({ userId });
-        return reply.code(200).send({ sales });
+        return reply.code(200).send({});
     } catch (error) {
         console.error(error); // Log the error for debugging purposes
killedBy: fetchAllSaleByUserId Controller should return sales for a valid user ID
statusReason: expected "spy" to be called with arguments: [ { sales: [ { …(6) }, { …(6) } ] } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/sale/fetch-all-by-user-id.ts:12:21
     try {
         const { sales } = await fetchAllSaleByUserIdService.execute({ userId });
         return reply.code(200).send({ sales });
-    } catch (error) {
-        console.error(error); // Log the error for debugging purposes
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: fetchAllSaleByUserId Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0
