[Killed] BlockStatement
http/controllers/sale/fetch-all.ts:4:82
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllSaleService } from "../../../services/factories/sale/make-fetch-all-sale-service";
 
-export async function fetchAllSale(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllSaleService = makeFetchAllSaleService();
-
-    try {
-        const { sale } = await fetchAllSaleService.execute();
-        console.log('Fetched sales:', sale); // Log para depuração
-        return reply.code(200).send({ sale });
-    } catch (error) {
-        console.error('Error fetching sales:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
-}
+export async function fetchAllSale(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchAllSale Controller should return all sales successfully
statusReason: expected "makeFetchAllSaleService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/sale/fetch-all.ts:7:9
 export async function fetchAllSale(request: FastifyRequest, reply: FastifyReply) {
     const fetchAllSaleService = makeFetchAllSaleService();
 
-    try {
-        const { sale } = await fetchAllSaleService.execute();
-        console.log('Fetched sales:', sale); // Log para depuração
-        return reply.code(200).send({ sale });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error fetching sales:', error); // Log para depuração
         return reply.code(500).send({ message: 'Internal Server Error' });
killedBy: fetchAllSale Controller should return all sales successfully
statusReason: expected "spy" to be called with arguments: []

Received: 



Number of calls: 0

[Killed] StringLiteral
http/controllers/sale/fetch-all.ts:9:21
 
     try {
         const { sale } = await fetchAllSaleService.execute();
-        console.log('Fetched sales:', sale); // Log para depuração
+        console.log("", sale); // Log para depuração
         return reply.code(200).send({ sale });
     } catch (error) {
killedBy: fetchAllSale Controller should return all sales successfully
statusReason: expected "log" to be called with arguments: [ 'Fetched sales:', …(1) ]

Received: 

  1st log call:

  Array [
-   "Fetched sales:",

[Killed] ObjectLiteral
http/controllers/sale/fetch-all.ts:10:37
     try {
         const { sale } = await fetchAllSaleService.execute();
         console.log('Fetched sales:', sale); // Log para depuração
-        return reply.code(200).send({ sale });
+        return reply.code(200).send({});
     } catch (error) {
         console.error('Error fetching sales:', error); // Log para depuração
killedBy: fetchAllSale Controller should return all sales successfully
statusReason: expected "spy" to be called with arguments: [ { sale: [ { …(6) }, …(2) ] } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/sale/fetch-all.ts:11:21
         const { sale } = await fetchAllSaleService.execute();
         console.log('Fetched sales:', sale); // Log para depuração
         return reply.code(200).send({ sale });
-    } catch (error) {
-        console.error('Error fetching sales:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: fetchAllSale Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "error" to be called with arguments: [ 'Error fetching sales:', …(1) ]

Received: 



Number of calls: 0
