[Killed] BlockStatement
http/controllers/sale/find-by-id.ts:4:82
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFindSaleByIdService } from "../../../services/factories/sale/make-find-sale-by-id-service";
 
-export async function findSaleById(request: FastifyRequest, reply: FastifyReply) {
-    const findSaleByIdService = makeFindSaleByIdService();
-
-    const { id } = request.params as { id: string };
-
-    try {
-        const { sale } = await findSaleByIdService.execute({ saleId: id });
-
-        if (!sale) {
-            return reply.code(404).send({ message: 'Sale not found' });
-        }
-
-        reply.code(200).send({ sale });
-    } catch (error) {
-        console.error('Error fetching sale by ID:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
-}
+export async function findSaleById(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: findSaleById Controller should return sale for a valid ID
statusReason: expected "makeFindSaleByIdService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/sale/find-by-id.ts:9:9
 
     const { id } = request.params as { id: string };
 
-    try {
-        const { sale } = await findSaleByIdService.execute({ saleId: id });
-
-        if (!sale) {
-            return reply.code(404).send({ message: 'Sale not found' });
-        }
-
-        reply.code(200).send({ sale });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error fetching sale by ID:', error); // Log para depuração
         return reply.code(500).send({ message: 'Internal Server Error' });
killedBy: findSaleById Controller should return sale for a valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/sale/find-by-id.ts:12:13
     try {
         const { sale } = await findSaleByIdService.execute({ saleId: id });
 
-        if (!sale) {
+        if (false) {
             return reply.code(404).send({ message: 'Sale not found' });
         }
killedBy: findSaleById Controller should return 404 when sale is not found (sale is null)
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 

  1st spy call:

  Array [
-   404,

[Killed] ConditionalExpression
http/controllers/sale/find-by-id.ts:12:13
     try {
         const { sale } = await findSaleByIdService.execute({ saleId: id });
 
-        if (!sale) {
+        if (true) {
             return reply.code(404).send({ message: 'Sale not found' });
         }
killedBy: findSaleById Controller should return sale for a valid ID
statusReason: expected "spy" to be called with arguments: [ 200 ]

Received: 

  1st spy call:

  Array [
-   200,

[Killed] BlockStatement
http/controllers/sale/find-by-id.ts:17:21
         }
 
         reply.code(200).send({ sale });
-    } catch (error) {
-        console.error('Error fetching sale by ID:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: findSaleById Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "error" to be called with arguments: [ 'Error fetching sale by ID:', …(1) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
http/controllers/sale/find-by-id.ts:19:48
         reply.code(200).send({ sale });
     } catch (error) {
         console.error('Error fetching sale by ID:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
+        return reply.code(500).send({ message: "" });
     }
 }
killedBy: findSaleById Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ObjectLiteral
http/controllers/sale/find-by-id.ts:19:37
         reply.code(200).send({ sale });
     } catch (error) {
         console.error('Error fetching sale by ID:', error); // Log para depuração
-        return reply.code(500).send({ message: 'Internal Server Error' });
+        return reply.code(500).send({});
     }
 }
killedBy: findSaleById Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
