[Killed] ObjectLiteral
http/controllers/supplier/create.ts:6:47
 import { makeCreateSupplierService } from "../../../services/factories/supplier/make-create-supplier-service";
 
 export async function createSupplier(request: FastifyRequest, reply: FastifyReply) {
-    const createSupplierBodySchema = z.object({
-        social_name: z.string(),
-        company_name: z.string(),
-        phone_number: z.string(),
-        cnpj: z.string(),
-    });
+    const createSupplierBodySchema = z.object({});
 
     try {
killedBy: createSupplier Controller should create a supplier successfully with valid data
statusReason: expected "spy" to be called with arguments: [ { …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/supplier/create.ts:13:9
         cnpj: z.string(),
     });
 
-    try {
-        const { social_name, company_name, phone_number, cnpj } = createSupplierBodySchema.parse(request.body);
-
-        const CreateSupplierService = makeCreateSupplierService();
-
-        const { supplier } = await CreateSupplierService.handle({
-            social_name,
-            company_name,
-            phone_number,
-            cnpj
-        });
-
-        reply.code(201).send({
-            supplier
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error); // Log do erro
 
killedBy: createSupplier Controller should create a supplier successfully with valid data
statusReason: expected "makeCreateSupplierService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/create.ts:18:65
 
         const CreateSupplierService = makeCreateSupplierService();
 
-        const { supplier } = await CreateSupplierService.handle({
-            social_name,
-            company_name,
-            phone_number,
-            cnpj
-        });
+        const { supplier } = await CreateSupplierService.handle({});
 
         reply.code(201).send({
killedBy: createSupplier Controller should create a supplier successfully with valid data
statusReason: expected "spy" to be called with arguments: [ { …(4) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/supplier/create.ts:28:21
         reply.code(201).send({
             supplier
         });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        // Se o erro for uma instância de ZodError, retorne um status 400
-        if (error instanceof z.ZodError) {
-            reply.code(400).send({ message: 'Invalid request data' });
-        } else {
-            // Em outros casos, retorne um status 500
-            reply.code(500).send({ message: 'Internal Server Error' });
-        }
-    }
+    } catch (error) {}
 }
 
killedBy: createSupplier Controller should return 400 for invalid request payload (ZodError) - missing required fields
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/supplier/create.ts:32:13
         console.error(error); // Log do erro
 
         // Se o erro for uma instância de ZodError, retorne um status 400
-        if (error instanceof z.ZodError) {
+        if (false) {
             reply.code(400).send({ message: 'Invalid request data' });
         } else {
killedBy: createSupplier Controller should return 400 for invalid request payload (ZodError) - missing required fields
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 

  1st spy call:

  Array [
-   400,

[Killed] ConditionalExpression
http/controllers/supplier/create.ts:32:13
         console.error(error); // Log do erro
 
         // Se o erro for uma instância de ZodError, retorne um status 400
-        if (error instanceof z.ZodError) {
+        if (true) {
             reply.code(400).send({ message: 'Invalid request data' });
         } else {
killedBy: createSupplier Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 

  1st spy call:

  Array [
-   500,

[Killed] StringLiteral
http/controllers/supplier/create.ts:33:45
 
         // Se o erro for uma instância de ZodError, retorne um status 400
         if (error instanceof z.ZodError) {
-            reply.code(400).send({ message: 'Invalid request data' });
+            reply.code(400).send({ message: "" });
         } else {
             // Em outros casos, retorne um status 500
killedBy: createSupplier Controller should return 400 for invalid request payload (ZodError) - missing required fields
statusReason: expected "spy" to be called with arguments: [ { message: 'Invalid request data' } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ObjectLiteral
http/controllers/supplier/create.ts:33:34
 
         // Se o erro for uma instância de ZodError, retorne um status 400
         if (error instanceof z.ZodError) {
-            reply.code(400).send({ message: 'Invalid request data' });
+            reply.code(400).send({});
         } else {
             // Em outros casos, retorne um status 500
killedBy: createSupplier Controller should return 400 for invalid request payload (ZodError) - missing required fields
statusReason: expected "spy" to be called with arguments: [ { message: 'Invalid request data' } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/supplier/create.ts:34:16
         // Se o erro for uma instância de ZodError, retorne um status 400
         if (error instanceof z.ZodError) {
             reply.code(400).send({ message: 'Invalid request data' });
-        } else {
-            // Em outros casos, retorne um status 500
-            reply.code(500).send({ message: 'Internal Server Error' });
-        }
+        } else {}
     }
 }
killedBy: createSupplier Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ 500 ]

Received: 



Number of calls: 0
