[Killed] BlockStatement
http/controllers/supplier/delete.ts:4:84
 import { FastifyRequest, FastifyReply } from "fastify"
 import { makeDeleteSupplierService } from "../../../services/factories/supplier/make-delete-supplier-service";
 
-export async function deleteSupplier(request: FastifyRequest, reply: FastifyReply) {
-    const deleteSupplierService = makeDeleteSupplierService();
-
-    const { id } = request.params as { id: string };
-
-    await deleteSupplierService.execute({
-        id: id
-    });
-
-    reply.code(204).send();
-}
+export async function deleteSupplier(request: FastifyRequest, reply: FastifyReply) {}
killedBy: deleteSupplier Controller should delete a supplier successfully with valid ID
statusReason: expected "makeDeleteSupplierService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/delete.ts:9:41
 
     const { id } = request.params as { id: string };
 
-    await deleteSupplierService.execute({
-        id: id
-    });
+    await deleteSupplierService.execute({});
 
     reply.code(204).send();
killedBy: deleteSupplier Controller should delete a supplier successfully with valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {
