[Killed] BlockStatement
http/controllers/supplier/fetch-all.ts:4:86
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchAllSupplierService } from "../../../services/factories/supplier/make-fetch-all-supplier-service";
 
-export async function fetchAllSupplier(request: FastifyRequest, reply: FastifyReply) {
-    const fetchAllSupplierService = makeFetchAllSupplierService();
-
-    const { supplier } = await fetchAllSupplierService.execute();
-
-    reply.code(200).send({
-        supplier
-    });
-}
+export async function fetchAllSupplier(request: FastifyRequest, reply: FastifyReply) {}
killedBy: fetchAllSupplier Controller should return all suppliers successfully
statusReason: expected "makeFetchAllSupplierService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/fetch-all.ts:9:26
 
     const { supplier } = await fetchAllSupplierService.execute();
 
-    reply.code(200).send({
-        supplier
-    });
+    reply.code(200).send({});
 }
killedBy: fetchAllSupplier Controller should return all suppliers successfully
statusReason: expected "spy" to be called with arguments: [ { supplier: [ { …(7) }, …(2) ] } ]

Received: 

  1st spy call:

  Array [
-   Object {
