[Killed] BlockStatement
http/controllers/supplier/fetch-many-by-company-name.ts:4:92
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchManySupplierByCompanyNameService } from "../../../services/factories/supplier/make-fetch-many-by-company-name";
 
-export async function fetchManyByCompanyName(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const fetchManyByCompanyNameService = makeFetchManySupplierByCompanyNameService();
-        const { companyName } = request.params as { companyName: string };
-        const { supplier } = await fetchManyByCompanyNameService.execute({
-            companyName: companyName
-        });
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        reply.code(500).send({
-            error: 'Internal Server Error',
-            message: 'An error occurred while fetching suppliers',
-            statusCode: 500
-        });
-    }
-}
+export async function fetchManyByCompanyName(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchManyByCompanyName Controller should return suppliers for a valid company name
statusReason: expected "makeFetchManySupplierByCompanyNameService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/supplier/fetch-many-by-company-name.ts:5:9
 import { makeFetchManySupplierByCompanyNameService } from "../../../services/factories/supplier/make-fetch-many-by-company-name";
 
 export async function fetchManyByCompanyName(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const fetchManyByCompanyNameService = makeFetchManySupplierByCompanyNameService();
-        const { companyName } = request.params as { companyName: string };
-        const { supplier } = await fetchManyByCompanyNameService.execute({
-            companyName: companyName
-        });
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error); // Log do erro
 
killedBy: fetchManyByCompanyName Controller should return suppliers for a valid company name
statusReason: expected "makeFetchManySupplierByCompanyNameService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/fetch-many-by-company-name.ts:8:74
     try {
         const fetchManyByCompanyNameService = makeFetchManySupplierByCompanyNameService();
         const { companyName } = request.params as { companyName: string };
-        const { supplier } = await fetchManyByCompanyNameService.execute({
-            companyName: companyName
-        });
+        const { supplier } = await fetchManyByCompanyNameService.execute({});
         reply.code(200).send({
             supplier
killedBy: fetchManyByCompanyName Controller should return suppliers for a valid company name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/supplier/fetch-many-by-company-name.ts:14:21
         reply.code(200).send({
             supplier
         });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        reply.code(500).send({
-            error: 'Internal Server Error',
-            message: 'An error occurred while fetching suppliers',
-            statusCode: 500
-        });
-    }
+    } catch (error) {}
 }
 
killedBy: fetchManyByCompanyName Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "error" to be called with arguments: [ Error: Resource not found ]

Received: 



Number of calls: 0

[Killed] StringLiteral
http/controllers/supplier/fetch-many-by-company-name.ts:18:20
         console.error(error); // Log do erro
 
         reply.code(500).send({
-            error: 'Internal Server Error',
+            error: "",
             message: 'An error occurred while fetching suppliers',
             statusCode: 500
killedBy: fetchManyByCompanyName Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ { …(3) } ]

Received: 

  1st spy call:

  Array [
    Object {
