[Killed] BlockStatement
http/controllers/supplier/fetch-many-by-social-name.ts:4:91
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFetchManySupplierBySocialNameService } from "../../../services/factories/supplier/make-fetch-many-by-social-name";
 
-export async function fetchManyBySocialName(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const fetchManyBySocialNameService = makeFetchManySupplierBySocialNameService();
-
-        const { socialName } = request.params as { socialName: string };
-
-        const { supplier } = await fetchManyBySocialNameService.execute({
-            socialName: socialName
-        });
-
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        reply.code(500).send({
-            error: 'Internal Server Error',
-            message: 'An error occurred while fetching suppliers',
-            statusCode: 500
-        });
-    }
-}
+export async function fetchManyBySocialName(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: fetchManyBySocialName Controller should return suppliers for a valid social name
statusReason: expected "makeFetchManySupplierBySocialNameService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/supplier/fetch-many-by-social-name.ts:5:9
 import { makeFetchManySupplierBySocialNameService } from "../../../services/factories/supplier/make-fetch-many-by-social-name";
 
 export async function fetchManyBySocialName(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const fetchManyBySocialNameService = makeFetchManySupplierBySocialNameService();
-
-        const { socialName } = request.params as { socialName: string };
-
-        const { supplier } = await fetchManyBySocialNameService.execute({
-            socialName: socialName
-        });
-
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error); // Log do erro
 
killedBy: fetchManyBySocialName Controller should return suppliers for a valid social name
statusReason: expected "makeFetchManySupplierBySocialNameService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/fetch-many-by-social-name.ts:10:73
 
         const { socialName } = request.params as { socialName: string };
 
-        const { supplier } = await fetchManyBySocialNameService.execute({
-            socialName: socialName
-        });
+        const { supplier } = await fetchManyBySocialNameService.execute({});
 
         reply.code(200).send({
killedBy: fetchManyBySocialName Controller should return suppliers for a valid social name
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] StringLiteral
http/controllers/supplier/fetch-many-by-social-name.ts:22:22
 
         reply.code(500).send({
             error: 'Internal Server Error',
-            message: 'An error occurred while fetching suppliers',
+            message: "",
             statusCode: 500
         });
killedBy: fetchManyBySocialName Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ { …(3) } ]

Received: 

  1st spy call:

  Array [
    Object {
