[Killed] BlockStatement
http/controllers/supplier/find-by-id.ts:4:86
 import { FastifyReply, FastifyRequest } from "fastify";
 import { makeFindSupplierByIdService } from "../../../services/factories/supplier/make-find-supplier-by-id-service";
 
-export async function findSupplierById(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const findSupplierByIdService = makeFindSupplierByIdService();
-
-        const { id } = request.params as { id: string };
-
-        const { supplier } = await findSupplierByIdService.execute({
-            supplierId: id
-        });
-
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        reply.code(500).send({
-            error: 'Internal Server Error',
-            message: 'An error occurred while fetching the supplier',
-            statusCode: 500
-        });
-    }
-}
+export async function findSupplierById(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: findSupplierById Controller should return supplier for a valid ID
statusReason: expected "makeFindSupplierByIdService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/supplier/find-by-id.ts:5:9
 import { makeFindSupplierByIdService } from "../../../services/factories/supplier/make-find-supplier-by-id-service";
 
 export async function findSupplierById(request: FastifyRequest, reply: FastifyReply) {
-    try {
-        const findSupplierByIdService = makeFindSupplierByIdService();
-
-        const { id } = request.params as { id: string };
-
-        const { supplier } = await findSupplierByIdService.execute({
-            supplierId: id
-        });
-
-        reply.code(200).send({
-            supplier
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error); // Log do erro
 
killedBy: findSupplierById Controller should return supplier for a valid ID
statusReason: expected "makeFindSupplierByIdService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/find-by-id.ts:10:68
 
         const { id } = request.params as { id: string };
 
-        const { supplier } = await findSupplierByIdService.execute({
-            supplierId: id
-        });
+        const { supplier } = await findSupplierByIdService.execute({});
 
         reply.code(200).send({
killedBy: findSupplierById Controller should return supplier for a valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/supplier/find-by-id.ts:17:21
         reply.code(200).send({
             supplier
         });
-    } catch (error) {
-        console.error(error); // Log do erro
-
-        reply.code(500).send({
-            error: 'Internal Server Error',
-            message: 'An error occurred while fetching the supplier',
-            statusCode: 500
-        });
-    }
+    } catch (error) {}
 }
 
killedBy: findSupplierById Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "error" to be called with arguments: [ Error: Resource not found ]

Received: 



Number of calls: 0
