[Killed] BlockStatement
http/controllers/supplier/patch.ts:13:9
         cnpj: z.string().optional()
     });
 
-    try {
-        // Validação dos dados de entrada
-        const { id } = request.params as { id: string };
-        const { social_name, company_name, phone_number, cnpj } = patchSupplierBodySchema.parse(request.body);
-
-        const patchSupplierService = makePatchSupplierService();
-        const { supplier } = await patchSupplierService.handle({
-            id,
-            data: {
-                social_name,
-                company_name,
-                phone_number,
-                cnpj,
-            },
-        });
-
-        return reply.code(200).send({
-            supplier,
-        });
-    } catch (error) {
+    try {} catch (error) {
         // Tratamento de erros
         if (error instanceof z.ZodError) {
killedBy: patchSupplier Controller should update supplier successfully with valid partial data
statusReason: expected "makePatchSupplierService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/supplier/patch.ts:21:19
         const patchSupplierService = makePatchSupplierService();
         const { supplier } = await patchSupplierService.handle({
             id,
-            data: {
-                social_name,
-                company_name,
-                phone_number,
-                cnpj,
-            },
+            data: {},
         });
 
killedBy: patchSupplier Controller should update supplier successfully with valid partial data
statusReason: expected "spy" to be called with arguments: [ { …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ObjectLiteral
http/controllers/supplier/patch.ts:29:37
             },
         });
 
-        return reply.code(200).send({
-            supplier,
-        });
+        return reply.code(200).send({});
     } catch (error) {
         // Tratamento de erros
killedBy: patchSupplier Controller should update supplier successfully with valid partial data
statusReason: expected "spy" to be called with arguments: [ { supplier: { …(7) } } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/supplier/patch.ts:32:21
         return reply.code(200).send({
             supplier,
         });
-    } catch (error) {
-        // Tratamento de erros
-        if (error instanceof z.ZodError) {
-            return reply.code(400).send({
-                statusCode: 400,
-                error: 'Bad Request',
-                message: 'Invalid input',
-            });
-        }
-
-        console.error(error); // Log do erro para debug
-        return reply.code(500).send({
-            statusCode: 500,
-            error: 'Internal Server Error',
-            message: 'An error occurred while updating the supplier',
-        });
-    }
+    } catch (error) {}
 }
 
killedBy: patchSupplier Controller should return 400 for invalid request payload (ZodError) - invalid field types
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 



Number of calls: 0

[Killed] BlockStatement
http/controllers/supplier/patch.ts:34:42
         });
     } catch (error) {
         // Tratamento de erros
-        if (error instanceof z.ZodError) {
-            return reply.code(400).send({
-                statusCode: 400,
-                error: 'Bad Request',
-                message: 'Invalid input',
-            });
-        }
+        if (error instanceof z.ZodError) {}
 
         console.error(error); // Log do erro para debug
killedBy: patchSupplier Controller should return 400 for invalid request payload (ZodError) - invalid field types
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 

  1st spy call:

  Array [
-   400,

[Killed] ConditionalExpression
http/controllers/supplier/patch.ts:34:13
         });
     } catch (error) {
         // Tratamento de erros
-        if (error instanceof z.ZodError) {
+        if (false) {
             return reply.code(400).send({
                 statusCode: 400,
killedBy: patchSupplier Controller should return 400 for invalid request payload (ZodError) - invalid field types
statusReason: expected "spy" to be called with arguments: [ 400 ]

Received: 

  1st spy call:

  Array [
-   400,

[Killed] StringLiteral
http/controllers/supplier/patch.ts:37:24
         if (error instanceof z.ZodError) {
             return reply.code(400).send({
                 statusCode: 400,
-                error: 'Bad Request',
+                error: "",
                 message: 'Invalid input',
             });
killedBy: patchSupplier Controller should return 400 for invalid request payload (ZodError) - invalid field types
statusReason: expected "spy" to be called with arguments: [ { statusCode: 400, …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] StringLiteral
http/controllers/supplier/patch.ts:46:22
         return reply.code(500).send({
             statusCode: 500,
             error: 'Internal Server Error',
-            message: 'An error occurred while updating the supplier',
+            message: "",
         });
     }
killedBy: patchSupplier Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "spy" to be called with arguments: [ { statusCode: 500, …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {
