[Killed] BlockStatement
http/controllers/user/delete.ts:6:80
 import { makeDeleteUserService } from "../../../services/factories/user/make-delete-user-service";
 import { ResourceNotFoundError } from "../../../services/errors/resource-not-found-error";
 
-export async function deleteUser(request: FastifyRequest, reply: FastifyReply) {
-    const deleteUserSchema = z.object({
-        id: z.string()
-    });
-
-    try {
-        const { id } = deleteUserSchema.parse(request.params);
-
-        const deleteUserService = makeDeleteUserService();
-
-        await deleteUserService.execute({ id });
-
-        return reply.status(200).send({ message: "User successfully deleted." });
-
-    } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: "User not found" });
-        }
-
-        console.error(error);
-        return reply.status(500).send({ message: 'Internal Server Error' });
-    }
-}
+export async function deleteUser(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: deleteUser Controller should delete user successfully with valid ID
statusReason: expected "makeDeleteUserService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/user/delete.ts:7:39
 import { ResourceNotFoundError } from "../../../services/errors/resource-not-found-error";
 
 export async function deleteUser(request: FastifyRequest, reply: FastifyReply) {
-    const deleteUserSchema = z.object({
-        id: z.string()
-    });
+    const deleteUserSchema = z.object({});
 
     try {
killedBy: deleteUser Controller should delete user successfully with valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
http/controllers/user/delete.ts:11:9
         id: z.string()
     });
 
-    try {
-        const { id } = deleteUserSchema.parse(request.params);
-
-        const deleteUserService = makeDeleteUserService();
-
-        await deleteUserService.execute({ id });
-
-        return reply.status(200).send({ message: "User successfully deleted." });
-
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof ResourceNotFoundError) {
             return reply.status(404).send({ message: "User not found" });
killedBy: deleteUser Controller should delete user successfully with valid ID
statusReason: expected "makeDeleteUserService" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
http/controllers/user/delete.ts:18:39
 
         await deleteUserService.execute({ id });
 
-        return reply.status(200).send({ message: "User successfully deleted." });
+        return reply.status(200).send({});
 
     } catch (error) {
killedBy: deleteUser Controller should delete user successfully with valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/user/delete.ts:20:21
 
         return reply.status(200).send({ message: "User successfully deleted." });
 
-    } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: "User not found" });
-        }
-
-        console.error(error);
-        return reply.status(500).send({ message: 'Internal Server Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: deleteUser Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
http/controllers/user/delete.ts:21:13
         return reply.status(200).send({ message: "User successfully deleted." });
 
     } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
+        if (false) {
             return reply.status(404).send({ message: "User not found" });
         }
killedBy: deleteUser Controller should handle ResourceNotFoundError with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 

  1st spy call:

  Array [
-   404,

[Killed] ConditionalExpression
http/controllers/user/delete.ts:21:13
         return reply.status(200).send({ message: "User successfully deleted." });
 
     } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
+        if (true) {
             return reply.status(404).send({ message: "User not found" });
         }
killedBy: deleteUser Controller should handle InactiveError with 500 response
statusReason: expected "error" to be called with arguments: [ …(1) ]

Received: 



Number of calls: 0
