[Killed] BlockStatement
http/controllers/user/fetch-all.ts:7:3
 export async function fetchAllUsers(
   request: FastifyRequest,
   reply: FastifyReply
-) {
-  try {
-    const fetchAllUserService = makeGetAllUsersService();
-
-    const { users } = await fetchAllUserService.execute();
-
-    return reply.status(200).send({ users: users });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
-}
+) {}
killedBy: fetchAllUsers Controller should return all users successfully
statusReason: expected "makeGetAllUsersService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/user/fetch-all.ts:8:7
   request: FastifyRequest,
   reply: FastifyReply
 ) {
-  try {
-    const fetchAllUserService = makeGetAllUsersService();
-
-    const { users } = await fetchAllUserService.execute();
-
-    return reply.status(200).send({ users: users });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return reply.status(500).send({ message: "Internal Server Error" });
killedBy: fetchAllUsers Controller should return all users successfully
statusReason: expected "makeGetAllUsersService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/user/fetch-all.ts:14:19
     const { users } = await fetchAllUserService.execute();
 
     return reply.status(200).send({ users: users });
-  } catch (error) {
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
killedBy: fetchAllUsers Controller should handle ResourceNotFoundError from service with 500 response
statusReason: expected "error" to be called with arguments: [ Error: Resource not found ]

Received: 



Number of calls: 0
