[Killed] BlockStatement
http/controllers/user/find-by-id.ts:5:82
 import { makeGetUserByIdService } from "../../../services/factories/user/make-get-user-by-id";
 import { ResourceNotFoundError } from "../../../services/errors/resource-not-found-error";
 
-export async function findUserByid(request: FastifyRequest, reply: FastifyReply) {
-    const findUserByid = makeGetUserByIdService();
-    const { id } = request.params as { id: string };
-
-    try {
-        const { user } = await findUserByid.execute({ userId: id });
-
-        if (!user) {
-            return reply.status(404).send({ message: "User not found" });
-        }
-
-        reply.code(200).send({ user });
-    } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: error.message });
-        }
-
-        console.error(error);
-        return reply.status(500).send({ message: "Internal Server Error" });
-    }
-}
+export async function findUserByid(request: FastifyRequest, reply: FastifyReply) {}
 
killedBy: findUserByid Controller should return user for a valid ID
statusReason: expected "makeGetUserByIdService" to be called 1 times, but got 0 times

[Killed] BlockStatement
http/controllers/user/find-by-id.ts:9:9
     const findUserByid = makeGetUserByIdService();
     const { id } = request.params as { id: string };
 
-    try {
-        const { user } = await findUserByid.execute({ userId: id });
-
-        if (!user) {
-            return reply.status(404).send({ message: "User not found" });
-        }
-
-        reply.code(200).send({ user });
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof ResourceNotFoundError) {
             return reply.status(404).send({ message: error.message });
killedBy: findUserByid Controller should return user for a valid ID
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
http/controllers/user/find-by-id.ts:16:30
             return reply.status(404).send({ message: "User not found" });
         }
 
-        reply.code(200).send({ user });
+        reply.code(200).send({});
     } catch (error) {
         if (error instanceof ResourceNotFoundError) {
killedBy: findUserByid Controller should return user for a valid ID
statusReason: expected "spy" to be called with arguments: [ { user: { …(6) } } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/user/find-by-id.ts:17:21
         }
 
         reply.code(200).send({ user });
-    } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: error.message });
-        }
-
-        console.error(error);
-        return reply.status(500).send({ message: "Internal Server Error" });
-    }
+    } catch (error) {}
 }
 
killedBy: findUserByid Controller should handle ResourceNotFoundError from service with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0

[Killed] BlockStatement
http/controllers/user/find-by-id.ts:18:53
 
         reply.code(200).send({ user });
     } catch (error) {
-        if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: error.message });
-        }
+        if (error instanceof ResourceNotFoundError) {}
 
         console.error(error);
killedBy: findUserByid Controller should handle ResourceNotFoundError from service with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 

  1st spy call:

  Array [
-   404,

[Killed] ObjectLiteral
http/controllers/user/find-by-id.ts:19:43
         reply.code(200).send({ user });
     } catch (error) {
         if (error instanceof ResourceNotFoundError) {
-            return reply.status(404).send({ message: error.message });
+            return reply.status(404).send({});
         }
 
killedBy: findUserByid Controller should handle ResourceNotFoundError from service with 404 response
statusReason: expected "spy" to be called with arguments: [ { message: 'Resource not found' } ]

Received: 

  1st spy call:

  Array [
-   Object {
