[Killed] ObjectLiteral
http/controllers/user/get-user-profile.ts:12:51
   const getUserProfile = makeGetUserProfileService();
 
   try {
-    const { user } = await getUserProfile.execute({
-      userId: request.user.sub
-    });
+    const { user } = await getUserProfile.execute({});
 
     const userId = user.id;
killedBy: profile Controller should return user profile with manager data for MANAGER role
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
http/controllers/user/get-user-profile.ts:18:36
 
     const userId = user.id;
 
-    const switchUser = async () => {
-      switch (user.role) {
-        case "MANAGER":
-          const findManagerByUserId = makeFindManagerByUserIdService();
-          const manager = await findManagerByUserId.execute({ userId });
-          return manager;
-        // case "EMPLOYEE":
-        //   const findEmployeeByUserIdService = makeFindEmployeeByUserIdService();
-        //   const employee = await findEmployeeByUserIdService.execute({ userId });
-        //   return employee;
-        default:
-          throw new ResourceNotFoundError();
-      }
-    };
+    const switchUser = async () => {};
 
     const switchedUser = await switchUser();
killedBy: profile Controller should return user profile with manager data for MANAGER role
statusReason: expected "makeFindManagerByUserIdService" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
http/controllers/user/get-user-profile.ts:20:9
 
     const switchUser = async () => {
       switch (user.role) {
-        case "MANAGER":
-          const findManagerByUserId = makeFindManagerByUserIdService();
-          const manager = await findManagerByUserId.execute({ userId });
-          return manager;
+        case "MANAGER":
+// case "EMPLOYEE":
+//   const findEmployeeByUserIdService = makeFindEmployeeByUserIdService();
+//   const employee = await findEmployeeByUserIdService.execute({ userId });
+//   return employee;
         // case "EMPLOYEE":
         //   const findEmployeeByUserIdService = makeFindEmployeeByUserIdService();
killedBy: profile Controller should return user profile with manager data for MANAGER role
statusReason: expected "makeFindManagerByUserIdService" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
http/controllers/user/get-user-profile.ts:28:9
         //   const findEmployeeByUserIdService = makeFindEmployeeByUserIdService();
         //   const employee = await findEmployeeByUserIdService.execute({ userId });
         //   return employee;
-        default:
-          throw new ResourceNotFoundError();
+        // case "EMPLOYEE":
+//   const findEmployeeByUserIdService = makeFindEmployeeByUserIdService();
+//   const employee = await findEmployeeByUserIdService.execute({ userId });
+//   return employee;
+default:
       }
     };
killedBy: profile Controller should handle ResourceNotFoundError for USER role with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 

  1st spy call:

  Array [
-   404,

[Killed] BlockStatement
http/controllers/user/get-user-profile.ts:39:19
       user,
       switchedUser
     });
-  } catch (error) {
-    if (error instanceof ResourceNotFoundError) {
-      return reply.status(404).send({ message: error.message });
-    }
-
-    console.error(error);
-    return reply.status(500).send({ message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
 
killedBy: profile Controller should handle ResourceNotFoundError for USER role with 404 response
statusReason: expected "spy" to be called with arguments: [ 404 ]

Received: 



Number of calls: 0
