[Killed] ConditionalExpression
src/services/employee/create-employee.ts:29:9
 
     const userWithSameEmail = await this.userRepository.findByEmail(email);
 
-    if (userWithSameEmail) {
+    if (false) {
       throw new Error("Email already exists.")
     }
killedBy: CreateEmployeeService execute should throw error when email already exists
statusReason: promise resolved "{ employee: { …(4) } }" instead of rejecting

[Killed] BlockStatement
src/services/employee/create-employee.ts:29:28
 
     const userWithSameEmail = await this.userRepository.findByEmail(email);
 
-    if (userWithSameEmail) {
-      throw new Error("Email already exists.")
-    }
+    if (userWithSameEmail) {}
 
     const userRole = "EMPLOYEE"
killedBy: CreateEmployeeService execute should throw error when email already exists
statusReason: expected [Function] to throw error including 'Email already exists.' but got 'Cannot read properties of undefined (…'

[Killed] ObjectLiteral
src/services/employee/create-employee.ts:35:51
 
     const userRole = "EMPLOYEE"
 
-    const user = await this.userRepository.create({
-      name,
-      email,
-      password_hash,
-      role: userRole
-    });
+    const user = await this.userRepository.create({});
 
     const employee = await this.employeeRepository.create({
killedBy: CreateEmployeeService execute should create an employee successfully
statusReason: expected "spy" to be called with arguments: [ { name: 'John Doe', …(3) } ]

Received: 

  1st spy call:

  Array [
-   Object {
