[Killed] BlockStatement
src/services/employee/fetch-all-employee.ts:11:61
 export class FetchAllEmployeeService {
   constructor(private employeeRepository: EmployeeRepository) {}
 
-  async execute(): Promise<FetchAllEmployeeServiceResponse> {
-    const employee = await this.employeeRepository.findMany();
-
-    return {
-      employee
-    };
-  }
+  async execute(): Promise<FetchAllEmployeeServiceResponse> {}
 }
killedBy: FetchAllEmployeeService execute should return all employees successfully
statusReason: expected "spy" to be called once, but got 0 times
