[Killed] BlockStatement
src/services/employee/find-employee-by-id.ts:18:80
 
   async execute({
     id,
-  }: FindEmployeeByIdServiceRequest): Promise<FindEmployeeByIdServiceResponse> {
-    const employee = await this.employeeRepository.findById(id)
-
-    return {
-      employee
-    };
-  }
+  }: FindEmployeeByIdServiceRequest): Promise<FindEmployeeByIdServiceResponse> {}
 }
killedBy: FindEmployeeByIdService execute should return employee when found
statusReason: expected "spy" to be called with arguments: [ 'employee-123' ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/services/employee/find-employee-by-id.ts:21:12
   }: FindEmployeeByIdServiceRequest): Promise<FindEmployeeByIdServiceResponse> {
     const employee = await this.employeeRepository.findById(id)
 
-    return {
-      employee
-    };
+    return {};
   }
 }
killedBy: FindEmployeeByIdService execute should return employee when found
statusReason: expected undefined to deeply equal { id: 'employee-123', …(3) }
