[Killed] BlockStatement
src/services/employee/find-employee-by-user-id.ts:19:74
 
   async execute({
     userId
-  }: FindEmployeeByUserIdRequest): Promise<FindEmployeeByUserIdResponse> {
-
-    const employee = await this.employeeRepository.findByUserId(userId)
-
-    return {
-      employee
-    }
-  }
+  }: FindEmployeeByUserIdRequest): Promise<FindEmployeeByUserIdResponse> {}
 }
killedBy: FindEmployeeByUserId execute should return employee when found by user ID
statusReason: expected "spy" to be called with arguments: [ 'user-123' ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/services/employee/find-employee-by-user-id.ts:23:12
 
     const employee = await this.employeeRepository.findByUserId(userId)
 
-    return {
-      employee
-    }
+    return {}
   }
 }
killedBy: FindEmployeeByUserId execute should return employee when found by user ID
statusReason: expected undefined to deeply equal { id: 'employee-123', …(3) }
