[Killed] ConditionalExpression
src/services/employee/update-employee.ts:36:11
         throw new Error("User not found.");
       }
 
-      if (password) {
+      if (false) {
         const hashedPassword = await hash(password, 6);
         await this.userRepository.update({
killedBy: UpdateEmployeeService execute should update employee with password successfully
statusReason: expected "spy" to be called with arguments: [ 'newpassword123', 6 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/employee/update-employee.ts:36:11
         throw new Error("User not found.");
       }
 
-      if (password) {
+      if (true) {
         const hashedPassword = await hash(password, 6);
         await this.userRepository.update({
killedBy: UpdateEmployeeService execute should update employee without password successfully
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      undefined,

[Killed] ObjectLiteral
src/services/employee/update-employee.ts:38:42
 
       if (password) {
         const hashedPassword = await hash(password, 6);
-        await this.userRepository.update({
-          id: user.id,
-          name,
-          email,
-          role: "EMPLOYEE",
-          password_hash: hashedPassword,
-        });
+        await this.userRepository.update({});
       }
 
killedBy: UpdateEmployeeService execute should update employee with password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] StringLiteral
src/services/employee/update-employee.ts:42:17
           id: user.id,
           name,
           email,
-          role: "EMPLOYEE",
+          role: "",
           password_hash: hashedPassword,
         });
killedBy: UpdateEmployeeService execute should update employee with password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
src/services/employee/update-employee.ts:47:22
         });
       }
 
-      if (!password) {
-        await this.userRepository.update({
-          id: user.id,
-          name,
-          email,
-          role: "EMPLOYEE",
-          password_hash: user.password_hash,
-        });
-      }
+      if (!password) {}
 
       const oldEmployee = await this.employeeRepository.findByUserId(user.id);
killedBy: UpdateEmployeeService execute should update employee without password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/services/employee/update-employee.ts:48:42
       }
 
       if (!password) {
-        await this.userRepository.update({
-          id: user.id,
-          name,
-          email,
-          role: "EMPLOYEE",
-          password_hash: user.password_hash,
-        });
+        await this.userRepository.update({});
       }
 
killedBy: UpdateEmployeeService execute should update employee without password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
src/services/employee/update-employee.ts:67:21
       return {
         employee: updatedEmployee
       };
-    } catch (error) {
-      throw new Error("Error updating employee: " + error);
-    }
+    } catch (error) {}
   }
 }
killedBy: UpdateEmployeeService execute should throw error when user not found
statusReason: promise resolved "undefined" instead of rejecting
