[Killed] ConditionalExpression
src/services/manager/create-manager.ts:30:9
   }: CreateManagerServiceRequest): Promise<CreateManagerServiceResponse> {
     const userWithSameEmail = await this.userRepository.findByEmail(email);
 
-    if (userWithSameEmail) {
+    if (true) {
       throw new UserAlreadyExistsError();
     }
killedBy: CreateManagerService execute should create a manager successfully
statusReason: E-mail already exists.

[Killed] BlockStatement
src/services/manager/create-manager.ts:30:28
   }: CreateManagerServiceRequest): Promise<CreateManagerServiceResponse> {
     const userWithSameEmail = await this.userRepository.findByEmail(email);
 
-    if (userWithSameEmail) {
-      throw new UserAlreadyExistsError();
-    }
+    if (userWithSameEmail) {}
 
     const password_hash = await hash(password, 10);
killedBy: CreateManagerService execute should throw UserAlreadyExistsError when email already exists
statusReason: expected error to be instance of UserAlreadyExistsError

[Killed] StringLiteral
src/services/manager/create-manager.ts:36:22
 
     const password_hash = await hash(password, 10);
 
-    const userRole = "MANAGER";
+    const userRole = "";
 
     const user = await this.userRepository.create({
killedBy: CreateManagerService execute should create a manager successfully
statusReason: expected "spy" to be called with arguments: [ { name: 'John Manager', …(3) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ObjectLiteral
src/services/manager/create-manager.ts:46:13
     });
 
     const manager = await this.managerRepository.create({
-      user: { connect: { id: user.id } },
+      user: {},
     });
 
killedBy: CreateManagerService execute should create a manager successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
    Object {
