[Killed] BlockStatement
src/services/manager/fetch-all-manager.ts:11:60
 export class FetchAllManagerService {
   constructor(private managerRepository: ManagerRepository) {}
 
-  async execute(): Promise<FetchAllManagerServiceResponse> {
-    const managers = await this.managerRepository.findMany();
-
-    return {
-      managers
-    };
-  }
+  async execute(): Promise<FetchAllManagerServiceResponse> {}
 }
killedBy: FetchAllManagerService execute should return all managers successfully
statusReason: expected "spy" to be called once, but got 0 times
