[Killed] BlockStatement
src/services/manager/find-manager-by-id.ts:19:78
 
   async execute({
     id,
-  }: FindManagerByIdServiceRequest): Promise<FindManagerByIdServiceResponse> {
-    // Busca o gerente pelo ID
-    const manager = await this.managerRepository.findById(id);
-
-    if (!manager) {
-      throw new NoRecordsFoundError();  // Lança o erro se não encontrado
-    }
-
-    return { manager };
-  }
+  }: FindManagerByIdServiceRequest): Promise<FindManagerByIdServiceResponse> {}
 }
 
killedBy: FindManagerByIdService execute should return manager when found by ID
statusReason: expected "spy" to be called with arguments: [ 'manager-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/manager/find-manager-by-id.ts:23:9
     // Busca o gerente pelo ID
     const manager = await this.managerRepository.findById(id);
 
-    if (!manager) {
+    if (false) {
       throw new NoRecordsFoundError();  // Lança o erro se não encontrado
     }
killedBy: FindManagerByIdService execute should throw NoRecordsFoundError when manager not found
statusReason: promise resolved "{ manager: null }" instead of rejecting

[Killed] BlockStatement
src/services/manager/find-manager-by-id.ts:23:19
     // Busca o gerente pelo ID
     const manager = await this.managerRepository.findById(id);
 
-    if (!manager) {
-      throw new NoRecordsFoundError();  // Lança o erro se não encontrado
-    }
+    if (!manager) {}
 
     return { manager };
killedBy: FindManagerByIdService execute should throw NoRecordsFoundError when manager not found
statusReason: promise resolved "{ manager: null }" instead of rejecting
