[Killed] BlockStatement
src/services/manager/update-manager.ts:32:16
   }: UpdateManagerServiceRequest): Promise<UpdateManagerServiceResponse> {
     const user = await this.userRepository.findById(userId);
 
-    if (!user) {
-      throw new NoRecordsFoundError();
-    }
+    if (!user) {}
 
     if (password) {
killedBy: UpdateManagerService execute should throw NoRecordsFoundError when user not found
statusReason: expected error to be instance of NoRecordsFoundError

[Killed] StringLiteral
src/services/manager/update-manager.ts:42:15
         id: user.id,
         name,
         email,
-        role: "MANAGER",
+        role: "",
         password_hash: hashedPassword,
       });
killedBy: UpdateManagerService execute should update manager with password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] BlockStatement
src/services/manager/update-manager.ts:45:12
         role: "MANAGER",
         password_hash: hashedPassword,
       });
-    } else {
-      await this.userRepository.update({
-        id: user.id,
-        name,
-        email,
-        role: "MANAGER",
-        password_hash: user.password_hash,
-      });
-    }
+    } else {}
 
     const oldManager = await this.managerRepository.findByUserId(user.id);
killedBy: UpdateManagerService execute should update manager without password successfully
statusReason: expected "spy" to be called with arguments: [ { id: 'user-123', …(4) } ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/manager/update-manager.ts:57:9
 
     const oldManager = await this.managerRepository.findByUserId(user.id);
 
-    if (!oldManager) {
+    if (false) {
       throw new NoRecordsFoundError();
     }
killedBy: UpdateManagerService execute should throw NoRecordsFoundError when manager not found for user
statusReason: expected error to be instance of NoRecordsFoundError

[Killed] BooleanLiteral
src/services/manager/update-manager.ts:57:9
 
     const oldManager = await this.managerRepository.findByUserId(user.id);
 
-    if (!oldManager) {
+    if (oldManager) {
       throw new NoRecordsFoundError();
     }
killedBy: UpdateManagerService execute should update manager with password successfully
statusReason: No records found.

[Killed] ObjectLiteral
src/services/manager/update-manager.ts:61:64
       throw new NoRecordsFoundError();
     }
 
-    const updatedManager = await this.managerRepository.update({
-      userId: user.id,
-      id: oldManager.id
-    });
+    const updatedManager = await this.managerRepository.update({});
 
     return {
killedBy: UpdateManagerService execute should update manager with password successfully
statusReason: expected "spy" to be called with arguments: [ { userId: 'user-123', …(1) } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] ObjectLiteral
src/services/manager/update-manager.ts:66:12
       id: oldManager.id
     });
 
-    return {
-      manager: updatedManager
-    };
+    return {};
   }
 }
killedBy: UpdateManagerService execute should update manager with password successfully
statusReason: expected undefined to deeply equal { id: 'manager-123', …(3) }
