[Killed] BlockStatement
src/services/manager/find-manager-by-user-id.ts:19:72
 
   async execute({
     userId
-  }: FindManagerByUserIdRequest): Promise<FindManagerByUserIdResponse> {
-
-    const manager = await this.managerRepository.findByUserId(userId)
-
-    return {
-      manager
-    }
-  }
+  }: FindManagerByUserIdRequest): Promise<FindManagerByUserIdResponse> {}
 }
killedBy: FindManagerByUserId execute should return manager when found by user ID
statusReason: expected "spy" to be called with arguments: [ 'user-123' ]

Received: 



Number of calls: 0
