[Killed] BlockStatement
src/services/product/create-product.ts:25:76
         price,
         quantity_in_stock,
         batch
-    }: CreateProductServiceRequest): Promise<CreateProductServiceResponse> {
-        const product = await this.productRepository.create({
-            name,
-            description,
-            price,
-            quantity_in_stock,
-            batch
-        });
-
-        return { product };
-    }
+    }: CreateProductServiceRequest): Promise<CreateProductServiceResponse> {}
 }
killedBy: CreateProductService handle should create a product successfully
statusReason: expected "spy" to be called with arguments: [ { name: 'Notebook Dell', …(4) } ]

Received: 



Number of calls: 0
