[Killed] BlockStatement
src/services/product/fetch-all-product.ts:11:62
 export class FetchAllProductService {
     constructor(private productRepository: ProductRepository) { }
 
-    async execute(): Promise<FetchAllProductServiceResponse> {
-        const product = await this.productRepository.findMany();
-
-        return {
-            product
-        };
-    }
+    async execute(): Promise<FetchAllProductServiceResponse> {}
 }
killedBy: FetchAllProductService execute should return all products successfully
statusReason: expected "spy" to be called once, but got 0 times
