[Killed] BlockStatement
src/services/product/find-product-by-id.ts:19:106
 
     }
 
-    async execute({ productId }: FindProductByIdServiceRequest): Promise<FindProductByIdServiceResponse> {
-        const product = await this.productRepository.findById(productId);
-
-        if (!product) {
-            throw new ResourceNotFoundError();
-        }
-
-        if (!product.is_active) {
-            throw new InactiveError();
-        }
-
-        return {
-            product
-        }
-    }
+    async execute({ productId }: FindProductByIdServiceRequest): Promise<FindProductByIdServiceResponse> {}
 }
killedBy: FindProductByIdService execute should return product when found and active
statusReason: expected "spy" to be called with arguments: [ 'product-123' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/services/product/find-product-by-id.ts:22:23
     async execute({ productId }: FindProductByIdServiceRequest): Promise<FindProductByIdServiceResponse> {
         const product = await this.productRepository.findById(productId);
 
-        if (!product) {
-            throw new ResourceNotFoundError();
-        }
+        if (!product) {}
 
         if (!product.is_active) {
killedBy: FindProductByIdService execute should throw ResourceNotFoundError when product not found
statusReason: expected error to be instance of ResourceNotFoundError

[Killed] BooleanLiteral
src/services/product/find-product-by-id.ts:26:13
             throw new ResourceNotFoundError();
         }
 
-        if (!product.is_active) {
+        if (product.is_active) {
             throw new InactiveError();
         }
killedBy: FindProductByIdService execute should return product when found and active
statusReason: Product does not exist or is inactive

[Killed] ConditionalExpression
src/services/product/find-product-by-id.ts:26:13
             throw new ResourceNotFoundError();
         }
 
-        if (!product.is_active) {
+        if (false) {
             throw new InactiveError();
         }
killedBy: FindProductByIdService execute should throw InactiveError when product is inactive
statusReason: promise resolved "{ product: { …(10) } }" instead of rejecting

[Killed] ObjectLiteral
src/services/product/find-product-by-id.ts:30:16
             throw new InactiveError();
         }
 
-        return {
-            product
-        }
+        return {}
     }
 }
killedBy: FindProductByIdService execute should return product when found and active
statusReason: expected undefined to deeply equal { id: 'product-123', …(9) }
