[Killed] BlockStatement
src/services/product/inactivate-product.ts:11:82
     constructor(private productRepository: ProductRepository) {
     }
 
-    async execute({ productId }: InactivateProductServiceRequest): Promise<void> {
-        const product = await this.productRepository.findById(productId);
-
-        if (!product) {
-            throw new Error('Product not found');
-        }
-
-        await this.productRepository.inactivate(productId);
-    }
+    async execute({ productId }: InactivateProductServiceRequest): Promise<void> {}
 }
 
killedBy: InactivateProductService execute should inactivate product successfully
statusReason: expected "spy" to be called with arguments: [ 'product-123' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/services/product/inactivate-product.ts:14:23
     async execute({ productId }: InactivateProductServiceRequest): Promise<void> {
         const product = await this.productRepository.findById(productId);
 
-        if (!product) {
-            throw new Error('Product not found');
-        }
+        if (!product) {}
 
         await this.productRepository.inactivate(productId);
killedBy: InactivateProductService execute should throw error when product not found
statusReason: promise resolved "undefined" instead of rejecting
