[Killed] BlockStatement
src/services/product/patch-product.ts:24:98
 export class PatchProductService {
     constructor(private productRepository: ProductRepository) { }
 
-    async handle({ id, data }: PatchProductServiceRequest): Promise<PatchProductServiceResponse> {
-        const productExists = await this.productRepository.findById(id);
-
-        if (!productExists) {
-            throw new ResourceNotFoundError();
-        }
-
-        if (!productExists.is_active) {
-            throw new InactiveError();
-        }
-
-        const product = await this.productRepository.patch(id, data);
-
-        return {
-            product
-        };
-    }
+    async handle({ id, data }: PatchProductServiceRequest): Promise<PatchProductServiceResponse> {}
 }
killedBy: PatchProductService handle should patch product successfully with partial data
statusReason: expected "spy" to be called with arguments: [ 'product-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/product/patch-product.ts:27:13
     async handle({ id, data }: PatchProductServiceRequest): Promise<PatchProductServiceResponse> {
         const productExists = await this.productRepository.findById(id);
 
-        if (!productExists) {
+        if (true) {
             throw new ResourceNotFoundError();
         }
killedBy: PatchProductService handle should patch product successfully with partial data
statusReason: Resource not found

[Killed] BlockStatement
src/services/product/patch-product.ts:27:29
     async handle({ id, data }: PatchProductServiceRequest): Promise<PatchProductServiceResponse> {
         const productExists = await this.productRepository.findById(id);
 
-        if (!productExists) {
-            throw new ResourceNotFoundError();
-        }
+        if (!productExists) {}
 
         if (!productExists.is_active) {
killedBy: PatchProductService handle should throw ResourceNotFoundError when product not found
statusReason: expected error to be instance of ResourceNotFoundError

[Killed] BlockStatement
src/services/product/patch-product.ts:31:39
             throw new ResourceNotFoundError();
         }
 
-        if (!productExists.is_active) {
-            throw new InactiveError();
-        }
+        if (!productExists.is_active) {}
 
         const product = await this.productRepository.patch(id, data);
killedBy: PatchProductService handle should throw InactiveError when product is inactive
statusReason: promise resolved "{ product: undefined }" instead of rejecting

[Killed] BooleanLiteral
src/services/product/patch-product.ts:31:13
             throw new ResourceNotFoundError();
         }
 
-        if (!productExists.is_active) {
+        if (productExists.is_active) {
             throw new InactiveError();
         }
killedBy: PatchProductService handle should patch product successfully with partial data
statusReason: Product does not exist or is inactive
