[Killed] BlockStatement
src/services/product/reduce-product-stock.ts:12:93
 export class ReduceProductStockService {
     constructor(private productRepository: ProductRepository) { }
 
-    async execute({ productId, quantity }: ReduceProductStockServiceRequest): Promise<void> {
-        const product = await this.productRepository.findById(productId);
-
-        if (!product) {
-            throw new ResourceNotFoundError();
-        }
-
-        if (product.quantity_in_stock === null) {
-            throw new Error('Product stock information is missing');
-        }
-
-        if (product.quantity_in_stock < quantity) {
-            throw new Error('Insufficient stock');
-        }
-
-        await this.productRepository.reduceStock(productId, quantity);
-    }
+    async execute({ productId, quantity }: ReduceProductStockServiceRequest): Promise<void> {}
 }
 
killedBy: ReduceProductStockService execute should reduce product stock successfully
statusReason: expected "spy" to be called with arguments: [ 'product-123' ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/services/product/reduce-product-stock.ts:19:13
             throw new ResourceNotFoundError();
         }
 
-        if (product.quantity_in_stock === null) {
+        if (product.quantity_in_stock !== null) {
             throw new Error('Product stock information is missing');
         }
killedBy: ReduceProductStockService execute should reduce product stock successfully
statusReason: Product stock information is missing

[Killed] ConditionalExpression
src/services/product/reduce-product-stock.ts:19:13
             throw new ResourceNotFoundError();
         }
 
-        if (product.quantity_in_stock === null) {
+        if (false) {
             throw new Error('Product stock information is missing');
         }
killedBy: ReduceProductStockService execute should throw error when product stock is null
statusReason: expected [Function] to throw error including 'Product stock information is missing' but got 'Insufficient stock'

[Killed] StringLiteral
src/services/product/reduce-product-stock.ts:20:29
         }
 
         if (product.quantity_in_stock === null) {
-            throw new Error('Product stock information is missing');
+            throw new Error("");
         }
 
killedBy: ReduceProductStockService execute should throw error when product stock is null
statusReason: expected [Function] to throw error including 'Product stock information is missing' but got ''

[Killed] ConditionalExpression
src/services/product/reduce-product-stock.ts:23:13
             throw new Error('Product stock information is missing');
         }
 
-        if (product.quantity_in_stock < quantity) {
+        if (true) {
             throw new Error('Insufficient stock');
         }
killedBy: ReduceProductStockService execute should reduce product stock successfully
statusReason: Insufficient stock

[Killed] ConditionalExpression
src/services/product/reduce-product-stock.ts:23:13
             throw new Error('Product stock information is missing');
         }
 
-        if (product.quantity_in_stock < quantity) {
+        if (false) {
             throw new Error('Insufficient stock');
         }
killedBy: ReduceProductStockService execute should throw error when insufficient stock
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/services/product/reduce-product-stock.ts:24:29
         }
 
         if (product.quantity_in_stock < quantity) {
-            throw new Error('Insufficient stock');
+            throw new Error("");
         }
 
killedBy: ReduceProductStockService execute should throw error when insufficient stock
statusReason: expected [Function] to throw error including 'Insufficient stock' but got ''
