[Killed] ObjectLiteral
src/services/purchase/create-purchase.ts:41:26
                 connect: { id: supplierId }
             },
             user: {
-                connect: { id: userId }
+                connect: {}
             },
         });
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected "spy" to be called with arguments: [ { nf_number: 'NF-123456', …(2) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ArrowFunction
src/services/purchase/create-purchase.ts:45:39
             },
         });
 
-        const productsIds = items.map((item) => item.productId);
+        const productsIds = items.map(() => undefined);
         const products = await this.productRepository.findManyByIds(productsIds);
 
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected "spy" to be called with arguments: [ [ 'product-1', 'product-2' ] ]

Received: 

  1st spy call:

  Array [
    Array [

[Killed] ConditionalExpression
src/services/purchase/create-purchase.ts:48:13
         const productsIds = items.map((item) => item.productId);
         const products = await this.productRepository.findManyByIds(productsIds);
 
-        if (products.length !== productsIds.length) {
+        if (true) {
             throw new Error('Product not found');
         }
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: Product not found

[Killed] ConditionalExpression
src/services/purchase/create-purchase.ts:48:13
         const productsIds = items.map((item) => item.productId);
         const products = await this.productRepository.findManyByIds(productsIds);
 
-        if (products.length !== productsIds.length) {
+        if (false) {
             throw new Error('Product not found');
         }
killedBy: CreatePurchaseService handle should throw error when product not found
statusReason: expected [Function] to throw error including 'Product not found' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/services/purchase/create-purchase.ts:49:29
         const products = await this.productRepository.findManyByIds(productsIds);
 
         if (products.length !== productsIds.length) {
-            throw new Error('Product not found');
+            throw new Error("");
         }
 
killedBy: CreatePurchaseService handle should throw error when product not found
statusReason: expected [Function] to throw error including 'Product not found' but got ''

[Killed] BlockStatement
src/services/purchase/create-purchase.ts:52:39
             throw new Error('Product not found');
         }
 
-        products.forEach((product) => {
-            if (!product.is_active) {
-                throw new Error(`Product ${product.name} does not exist or is inactive`);
-            }
-        });
+        products.forEach((product) => {});
 
         const createdItems = await Promise.all(
killedBy: CreatePurchaseService handle should throw error when product is inactive
statusReason: expected [Function] to throw error including 'Product Product 1 does not exist or i…' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/services/purchase/create-purchase.ts:53:17
         }
 
         products.forEach((product) => {
-            if (!product.is_active) {
+            if (true) {
                 throw new Error(`Product ${product.name} does not exist or is inactive`);
             }
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: Product Product 1 does not exist or is inactive

[Killed] BlockStatement
src/services/purchase/create-purchase.ts:53:37
         }
 
         products.forEach((product) => {
-            if (!product.is_active) {
-                throw new Error(`Product ${product.name} does not exist or is inactive`);
-            }
+            if (!product.is_active) {}
         });
 
killedBy: CreatePurchaseService handle should throw error when product is inactive
statusReason: expected [Function] to throw error including 'Product Product 1 does not exist or i…' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/services/purchase/create-purchase.ts:59:39
         });
 
         const createdItems = await Promise.all(
-            items.map(async (item) => {
-                await this.productRepository.increaseStock(item.productId, item.quantity);
-
-                return this.itemRepository.create({
-                    purchase: { connect: { id: purchase.id } },
-                    quantity: item.quantity,
-                    value: item.value,
-                    product: {
-                        connect: { id: item.productId }
-                    },
-                });
-            })
+            items.map(async (item) => {})
         );
 
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ObjectLiteral
src/services/purchase/create-purchase.ts:63:42
                 await this.productRepository.increaseStock(item.productId, item.quantity);
 
                 return this.itemRepository.create({
-                    purchase: { connect: { id: purchase.id } },
+                    purchase: { connect: {} },
                     quantity: item.quantity,
                     value: item.value,
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected 1st "spy" call to have been called with [ { purchase: { …(1) }, …(3) } ]

[Killed] BlockStatement
src/services/purchase/create-purchase.ts:73:61
             })
         );
 
-        const subTotal = createdItems.reduce((acc, item) => {
-            return acc + item.value * item.quantity;
-        }, 0);
+        const subTotal = createdItems.reduce((acc, item) => {}, 0);
 
         const newPurchase = await this.purchaseRepository.updateSubTotal(purchase.id, subTotal);
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected "spy" to be called with arguments: [ 'purchase-123', 333.75 ]

Received: 

  1st spy call:

  Array [
    "purchase-123",

[Killed] ArithmeticOperator
src/services/purchase/create-purchase.ts:74:26
         );
 
         const subTotal = createdItems.reduce((acc, item) => {
-            return acc + item.value * item.quantity;
+            return acc + item.value / item.quantity;
         }, 0);
 
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected "spy" to be called with arguments: [ 'purchase-123', 333.75 ]

Received: 

  1st spy call:

  Array [
    "purchase-123",

[Killed] ArithmeticOperator
src/services/purchase/create-purchase.ts:74:20
         );
 
         const subTotal = createdItems.reduce((acc, item) => {
-            return acc + item.value * item.quantity;
+            return acc - item.value * item.quantity;
         }, 0);
 
killedBy: CreatePurchaseService handle should create purchase successfully with multiple items
statusReason: expected "spy" to be called with arguments: [ 'purchase-123', 333.75 ]

Received: 

  1st spy call:

  Array [
    "purchase-123",
