[Killed] BlockStatement
src/services/purchase/fetch-all-purchase-by-supplier-id.ts:19:133
 
     }
 
-    async execute({ supplierId }: FetchAllPurchaseBySupplierIdServiceRequest): Promise<FetchAllPurchaseBySupplierIdServiceResponse> {
-        const supplier = await this.supplierRepository.findById(supplierId);
-
-        if (!supplier) {
-            throw new ResourceNotFoundError();
-        }
-
-        const purchases = await this.purchaseRepository.findManyBySupplierId(supplierId);
-
-        return {
-            purchases
-        }
-    }
+    async execute({ supplierId }: FetchAllPurchaseBySupplierIdServiceRequest): Promise<FetchAllPurchaseBySupplierIdServiceResponse> {}
 }
killedBy: FetchAllPurchaseBySupplierIdService execute should return purchases for supplier successfully
statusReason: expected "spy" to be called with arguments: [ 'supplier-123' ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/services/purchase/fetch-all-purchase-by-supplier-id.ts:22:13
     async execute({ supplierId }: FetchAllPurchaseBySupplierIdServiceRequest): Promise<FetchAllPurchaseBySupplierIdServiceResponse> {
         const supplier = await this.supplierRepository.findById(supplierId);
 
-        if (!supplier) {
+        if (supplier) {
             throw new ResourceNotFoundError();
         }
killedBy: FetchAllPurchaseBySupplierIdService execute should return purchases for supplier successfully
statusReason: Resource not found

[Killed] ConditionalExpression
src/services/purchase/fetch-all-purchase-by-supplier-id.ts:22:13
     async execute({ supplierId }: FetchAllPurchaseBySupplierIdServiceRequest): Promise<FetchAllPurchaseBySupplierIdServiceResponse> {
         const supplier = await this.supplierRepository.findById(supplierId);
 
-        if (!supplier) {
+        if (true) {
             throw new ResourceNotFoundError();
         }
killedBy: FetchAllPurchaseBySupplierIdService execute should return purchases for supplier successfully
statusReason: Resource not found
