[Killed] BlockStatement
src/services/purchase/fetch-all-purchase-by-user-id.ts:19:121
 
     }
 
-    async execute({ userId }: FetchAllPurchaseByUserIdServiceRequest): Promise<FetchAllPurchaseByUserIdServiceResponse> {
-        const user = await this.userRepository.findById(userId);
-
-        if (!user) {
-            throw new ResourceNotFoundError();
-        }
-
-        const purchases = await this.purchaseRepository.findManyByUserId(userId);
-
-        return {
-            purchases
-        }
-    }
+    async execute({ userId }: FetchAllPurchaseByUserIdServiceRequest): Promise<FetchAllPurchaseByUserIdServiceResponse> {}
 }
killedBy: FetchAllPurchaseByUserIdService execute should return purchases for user successfully
statusReason: expected "spy" to be called with arguments: [ 'user-123' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/services/purchase/fetch-all-purchase-by-user-id.ts:22:20
     async execute({ userId }: FetchAllPurchaseByUserIdServiceRequest): Promise<FetchAllPurchaseByUserIdServiceResponse> {
         const user = await this.userRepository.findById(userId);
 
-        if (!user) {
-            throw new ResourceNotFoundError();
-        }
+        if (!user) {}
 
         const purchases = await this.purchaseRepository.findManyByUserId(userId);
killedBy: FetchAllPurchaseByUserIdService execute should throw ResourceNotFoundError when user not found
statusReason: promise resolved "{ purchases: undefined }" instead of rejecting
