[Killed] BlockStatement
src/services/purchase/fetch-all-purchase.ts:11:63
 export class FetchAllPurchaseService {
     constructor(private purchaseRepository: PurchaseRepository) { }
 
-    async execute(): Promise<FetchAllPurchaseServiceResponse> {
-        const purchase = await this.purchaseRepository.findMany();
-
-        return {
-            purchase
-        };
-    }
+    async execute(): Promise<FetchAllPurchaseServiceResponse> {}
 }
killedBy: FetchAllPurchaseService execute should return all purchases successfully
statusReason: expected "spy" to be called once, but got 0 times
