[Killed] BlockStatement
src/services/purchase/find-purchase-by-id.ts:18:109
 
     }
 
-    async execute({ purchaseId }: FindPurchaseByIdServiceRequest): Promise<FindPurchaseByIdServiceResponse> {
-        const purchase = await this.purchaseRepository.findById(purchaseId);
-
-        if (!purchase) {
-            throw new ResourceNotFoundError();
-        }
-
-        return {
-            purchase
-        }
-    }
+    async execute({ purchaseId }: FindPurchaseByIdServiceRequest): Promise<FindPurchaseByIdServiceResponse> {}
 }
killedBy: FindPurchaseByIdService execute should return purchase when found by ID
statusReason: expected "spy" to be called with arguments: [ 'purchase-123' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/purchase/find-purchase-by-id.ts:21:13
     async execute({ purchaseId }: FindPurchaseByIdServiceRequest): Promise<FindPurchaseByIdServiceResponse> {
         const purchase = await this.purchaseRepository.findById(purchaseId);
 
-        if (!purchase) {
+        if (false) {
             throw new ResourceNotFoundError();
         }
killedBy: FindPurchaseByIdService execute should throw ResourceNotFoundError when purchase not found
statusReason: promise resolved "{ purchase: null }" instead of rejecting

[Killed] BooleanLiteral
src/services/purchase/find-purchase-by-id.ts:21:13
     async execute({ purchaseId }: FindPurchaseByIdServiceRequest): Promise<FindPurchaseByIdServiceResponse> {
         const purchase = await this.purchaseRepository.findById(purchaseId);
 
-        if (!purchase) {
+        if (purchase) {
             throw new ResourceNotFoundError();
         }
killedBy: FindPurchaseByIdService execute should return purchase when found by ID
statusReason: Resource not found

[Killed] ObjectLiteral
src/services/purchase/find-purchase-by-id.ts:25:16
             throw new ResourceNotFoundError();
         }
 
-        return {
-            purchase
-        }
+        return {}
     }
 }
killedBy: FindPurchaseByIdService execute should return purchase when found by ID
statusReason: expected undefined to deeply equal { id: 'purchase-123', …(6) }
