[Killed] MethodExpression
src/services/sale/create-sale.ts:45:34
         const products = await this.productRepository.findManyByIds(productsIds);
 
         // Verificar se todos os produtos foram encontrados
-        const notFoundProducts = productsIds.filter(id => !products.find(product => product.id === id));
+        const notFoundProducts = productsIds;
         if (notFoundProducts.length > 0) {
             throw new Error('Product not found' + { productsIds });
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Product not found[object Object]

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:45:85
         const products = await this.productRepository.findManyByIds(productsIds);
 
         // Verificar se todos os produtos foram encontrados
-        const notFoundProducts = productsIds.filter(id => !products.find(product => product.id === id));
+        const notFoundProducts = productsIds.filter(id => !products.find(product => true));
         if (notFoundProducts.length > 0) {
             throw new Error('Product not found' + { productsIds });
killedBy: CreateSaleService handle should throw error when product not found
statusReason: expected [Function] to throw error including 'Product not found' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:46:13
 
         // Verificar se todos os produtos foram encontrados
         const notFoundProducts = productsIds.filter(id => !products.find(product => product.id === id));
-        if (notFoundProducts.length > 0) {
+        if (true) {
             throw new Error('Product not found' + { productsIds });
         }
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Product not found[object Object]

[Killed] BlockStatement
src/services/sale/create-sale.ts:46:42
 
         // Verificar se todos os produtos foram encontrados
         const notFoundProducts = productsIds.filter(id => !products.find(product => product.id === id));
-        if (notFoundProducts.length > 0) {
-            throw new Error('Product not found' + { productsIds });
-        }
+        if (notFoundProducts.length > 0) {}
 
         // Verificar se os produtos estão ativos e se há estoque suficiente
killedBy: CreateSaleService handle should throw error when product not found
statusReason: expected [Function] to throw error including 'Product not found' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/services/sale/create-sale.ts:51:41
         }
 
         // Verificar se os produtos estão ativos e se há estoque suficiente
-        for (const product of products) {
-            const correspondingItem = items.find(item => item.productId === product.id);
-
-            if (!product.is_active) {
-                throw new Error(`Product ${product.name} is inactive`);
-            }
-
-            if (product.quantity_in_stock == null) {
-                throw new Error(`Stock quantity for product ${product.name} is undefined`);
-            }
-
-            if (product.quantity_in_stock < correspondingItem!.quantity) {
-                throw new Error(`Insufficient stock for product ${product.name}`);
-            }
-        }
+        for (const product of products) {}
 
         const createdItems = await Promise.all(
killedBy: CreateSaleService handle should throw error when product is inactive
statusReason: expected [Function] to throw error including 'Product Product 1 is inactive' but got 'Cannot read properties of undefined (…'

[Killed] ArrowFunction
src/services/sale/create-sale.ts:52:50
 
         // Verificar se os produtos estão ativos e se há estoque suficiente
         for (const product of products) {
-            const correspondingItem = items.find(item => item.productId === product.id);
+            const correspondingItem = items.find(() => undefined);
 
             if (!product.is_active) {
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:52:58
 
         // Verificar se os produtos estão ativos e se há estoque suficiente
         for (const product of products) {
-            const correspondingItem = items.find(item => item.productId === product.id);
+            const correspondingItem = items.find(item => false);
 
             if (!product.is_active) {
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Cannot read properties of undefined (reading 'quantity')

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:54:17
         for (const product of products) {
             const correspondingItem = items.find(item => item.productId === product.id);
 
-            if (!product.is_active) {
+            if (true) {
                 throw new Error(`Product ${product.name} is inactive`);
             }
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Product Product 1 is inactive

[Killed] BlockStatement
src/services/sale/create-sale.ts:54:37
         for (const product of products) {
             const correspondingItem = items.find(item => item.productId === product.id);
 
-            if (!product.is_active) {
-                throw new Error(`Product ${product.name} is inactive`);
-            }
+            if (!product.is_active) {}
 
             if (product.quantity_in_stock == null) {
killedBy: CreateSaleService handle should throw error when product is inactive
statusReason: expected [Function] to throw error including 'Product Product 1 is inactive' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:58:17
                 throw new Error(`Product ${product.name} is inactive`);
             }
 
-            if (product.quantity_in_stock == null) {
+            if (true) {
                 throw new Error(`Stock quantity for product ${product.name} is undefined`);
             }
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Stock quantity for product Product 1 is undefined

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:58:17
                 throw new Error(`Product ${product.name} is inactive`);
             }
 
-            if (product.quantity_in_stock == null) {
+            if (false) {
                 throw new Error(`Stock quantity for product ${product.name} is undefined`);
             }
killedBy: CreateSaleService handle should throw error when product stock is null
statusReason: expected [Function] to throw error including 'Stock quantity for product Product 1 …' but got 'Insufficient stock for product Produc…'

[Killed] StringLiteral
src/services/sale/create-sale.ts:59:33
             }
 
             if (product.quantity_in_stock == null) {
-                throw new Error(`Stock quantity for product ${product.name} is undefined`);
+                throw new Error(``);
             }
 
killedBy: CreateSaleService handle should throw error when product stock is null
statusReason: expected [Function] to throw error including 'Stock quantity for product Product 1 …' but got ''

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:62:17
                 throw new Error(`Stock quantity for product ${product.name} is undefined`);
             }
 
-            if (product.quantity_in_stock < correspondingItem!.quantity) {
+            if (true) {
                 throw new Error(`Insufficient stock for product ${product.name}`);
             }
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Insufficient stock for product Product 1

[Killed] ConditionalExpression
src/services/sale/create-sale.ts:62:17
                 throw new Error(`Stock quantity for product ${product.name} is undefined`);
             }
 
-            if (product.quantity_in_stock < correspondingItem!.quantity) {
+            if (false) {
                 throw new Error(`Insufficient stock for product ${product.name}`);
             }
killedBy: CreateSaleService handle should throw error when insufficient stock
statusReason: expected [Function] to throw error including 'Insufficient stock for product Produc…' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/services/sale/create-sale.ts:63:33
             }
 
             if (product.quantity_in_stock < correspondingItem!.quantity) {
-                throw new Error(`Insufficient stock for product ${product.name}`);
+                throw new Error(``);
             }
         }
killedBy: CreateSaleService handle should throw error when insufficient stock
statusReason: expected [Function] to throw error including 'Insufficient stock for product Produc…' but got ''

[Killed] BlockStatement
src/services/sale/create-sale.ts:68:39
         }
 
         const createdItems = await Promise.all(
-            items.map(async (item) => {
-                await this.productRepository.reduceStock(item.productId, item.quantity);
-
-                return this.itemRepository.create({
-                    sale: { connect: { id: sale.id } },
-                    quantity: item.quantity,
-                    value: item.value,
-                    product: {
-                        connect: { id: item.productId }
-                    },
-                });
-            })
+            items.map(async (item) => {})
         );
 
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ObjectLiteral
src/services/sale/create-sale.ts:72:27
                 await this.productRepository.reduceStock(item.productId, item.quantity);
 
                 return this.itemRepository.create({
-                    sale: { connect: { id: sale.id } },
+                    sale: {},
                     quantity: item.quantity,
                     value: item.value,
killedBy: CreateSaleService handle should create sale successfully with multiple items
statusReason: expected 1st "spy" call to have been called with [ { …(4) } ]
