[Killed] BlockStatement
src/services/sale/fetch-all-sale-by-user-id.ts:19:113
 
     }
 
-    async execute({ userId }: FetchAllSaleByUserIdServiceRequest): Promise<FetchAllSaleByUserIdServiceResponse> {
-        const user = await this.userRepository.findById(userId);
-
-        if (!user) {
-            throw new ResourceNotFoundError();
-        }
-
-        const sales = await this.saleRepository.findManyByUserId(userId);
-
-        return {
-            sales
-        }
-    }
+    async execute({ userId }: FetchAllSaleByUserIdServiceRequest): Promise<FetchAllSaleByUserIdServiceResponse> {}
 }
killedBy: FetchAllSaleByUserIdService execute should return sales for user successfully
statusReason: expected "spy" to be called with arguments: [ 'user-123' ]

Received: 



Number of calls: 0
