[Killed] BlockStatement
src/services/sale/find-sale-by-id.ts:18:97
 
     }
 
-    async execute({ saleId }: FindSaleByIdServiceRequest): Promise<FindSaleByIdServiceResponse> {
-        const sale = await this.saleRepository.findById(saleId);
-
-        if (!sale) {
-            throw new ResourceNotFoundError();
-        }
-
-        return {
-            sale
-        }
-    }
+    async execute({ saleId }: FindSaleByIdServiceRequest): Promise<FindSaleByIdServiceResponse> {}
 }
killedBy: FindSaleByIdService execute should return sale when found by ID
statusReason: expected "spy" to be called with arguments: [ 'sale-123' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/services/sale/find-sale-by-id.ts:21:20
     async execute({ saleId }: FindSaleByIdServiceRequest): Promise<FindSaleByIdServiceResponse> {
         const sale = await this.saleRepository.findById(saleId);
 
-        if (!sale) {
-            throw new ResourceNotFoundError();
-        }
+        if (!sale) {}
 
         return {
killedBy: FindSaleByIdService execute should throw ResourceNotFoundError when sale not found
statusReason: promise resolved "{ sale: null }" instead of rejecting

[Killed] ObjectLiteral
src/services/sale/find-sale-by-id.ts:25:16
             throw new ResourceNotFoundError();
         }
 
-        return {
-            sale
-        }
+        return {}
     }
 }
killedBy: FindSaleByIdService execute should return sale when found by ID
statusReason: expected undefined to deeply equal { id: 'sale-123', …(5) }
