[Killed] BlockStatement
src/services/sale/fetch-all-sale.ts:11:59
 export class FetchAllSaleService {
     constructor(private saleRepository: SaleRepository) { }
 
-    async execute(): Promise<FetchAllSaleServiceResponse> {
-        const sale = await this.saleRepository.findMany();
-
-        return {
-            sale
-        };
-    }
+    async execute(): Promise<FetchAllSaleServiceResponse> {}
 }
killedBy: FetchAllSaleService execute should return all sales successfully
statusReason: expected "spy" to be called once, but got 0 times

[Killed] ObjectLiteral
src/services/sale/fetch-all-sale.ts:14:16
     async execute(): Promise<FetchAllSaleServiceResponse> {
         const sale = await this.saleRepository.findMany();
 
-        return {
-            sale
-        };
+        return {};
     }
 }
killedBy: FetchAllSaleService execute should return all sales successfully
statusReason: expected undefined to deeply equal [ { id: 'sale-1', …(5) }, …(2) ]
