[Killed] BlockStatement
src/services/supplier/create-supplier.ts:23:78
         company_name,
         phone_number,
         cnpj,
-    }: CreateSupplierServiceRequest): Promise<CreateSupplierServiceResponse> {
-
-        const supplier = await this.supplierRepository.create({
-            social_name,
-            company_name,
-            phone_number,
-            cnpj,
-        });
-
-        return { supplier };
-    }
+    }: CreateSupplierServiceRequest): Promise<CreateSupplierServiceResponse> {}
 }
killedBy: CreateSupplierService handle should create a supplier successfully
statusReason: expected "spy" to be called with arguments: [ { …(4) } ]

Received: 



Number of calls: 0
