[Killed] BlockStatement
src/services/supplier/delete-supplier.ts:11:70
 export class DeleteSupplierService {
   constructor(private supplierRepository: SupplierRepository) {}
 
-  async execute({ id }: DeleteSupplierServiceRequest): Promise<void> {
-    const supplier = await this.supplierRepository.delete(id);
-
-    if (!supplier) {
-      throw new NoRecordsFoundError;
-    }
-  }
+  async execute({ id }: DeleteSupplierServiceRequest): Promise<void> {}
 }
 
killedBy: DeleteSupplierService should delete a supplier successfully
statusReason: expected "spy" to be called with arguments: [ '1' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/services/supplier/delete-supplier.ts:14:20
   async execute({ id }: DeleteSupplierServiceRequest): Promise<void> {
     const supplier = await this.supplierRepository.delete(id);
 
-    if (!supplier) {
-      throw new NoRecordsFoundError;
-    }
+    if (!supplier) {}
   }
 }
killedBy: DeleteSupplierService should throw NoRecordsFoundError when supplier does not exist
statusReason: promise resolved "undefined" instead of rejecting
