[Killed] BlockStatement
src/services/supplier/fetch-all-supplier.ts:11:63
 export class FetchAllSupplierService {
     constructor(private supplierRepository: SupplierRepository) { }
 
-    async execute(): Promise<FetchAllSupplierServiceResponse> {
-        const supplier = await this.supplierRepository.findMany();
-
-        return {
-            supplier
-        };
-    }
+    async execute(): Promise<FetchAllSupplierServiceResponse> {}
 }
killedBy: FetchAllSupplierService execute should return all suppliers successfully
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/services/supplier/fetch-all-supplier.ts:14:16
     async execute(): Promise<FetchAllSupplierServiceResponse> {
         const supplier = await this.supplierRepository.findMany();
 
-        return {
-            supplier
-        };
+        return {};
     }
 }
killedBy: FetchAllSupplierService execute should return all suppliers successfully
statusReason: expected undefined to deeply equal [ Array(2) ]
