[Killed] BlockStatement
src/services/supplier/fetch-many-supplier-by-company-name.ts:15:138
 export class FetchManySupplierByCompanyNameService {
     constructor(private supplierRepository: SupplierRepository) { }
 
-    async execute({ companyName }: FetchManySupplierByCompanyNameServiceRequest): Promise<FetchManySupplierByCompanyNameServiceResponse> {
-        const supplier = await this.supplierRepository.findManyByCompanyName(companyName);
-
-        return {
-            supplier
-        };
-    }
+    async execute({ companyName }: FetchManySupplierByCompanyNameServiceRequest): Promise<FetchManySupplierByCompanyNameServiceResponse> {}
 }
killedBy: FetchManySupplierByCompanyNameService execute should return suppliers by company name successfully
statusReason: expected "spy" to be called 1 times, but got 0 times
