[Killed] BlockStatement
src/services/supplier/fetch-many-supplier-by-social-name.ts:16:135
 export class FetchManySupplierBySocialNameService {
     constructor(private supplierRepository: SupplierRepository) {}
 
-    async execute({ socialName }: FetchManySupplierBySocialNameServiceRequest): Promise<FetchManySupplierBySocialNameServiceResponse> {
-        const suppliers = await this.supplierRepository.findManyBySocialName(socialName);
-
-        if (suppliers.length === 0) {
-            throw new NoRecordsFoundError();
-        }
-
-        return {
-            suppliers
-        };
-    }
+    async execute({ socialName }: FetchManySupplierBySocialNameServiceRequest): Promise<FetchManySupplierBySocialNameServiceResponse> {}
 }
 
killedBy: FetchManySupplierBySocialNameService execute should return suppliers by social name successfully
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/services/supplier/fetch-many-supplier-by-social-name.ts:19:13
     async execute({ socialName }: FetchManySupplierBySocialNameServiceRequest): Promise<FetchManySupplierBySocialNameServiceResponse> {
         const suppliers = await this.supplierRepository.findManyBySocialName(socialName);
 
-        if (suppliers.length === 0) {
+        if (suppliers.length !== 0) {
             throw new NoRecordsFoundError();
         }
killedBy: FetchManySupplierBySocialNameService execute should return suppliers by social name successfully
statusReason: No records found.

[Killed] BlockStatement
src/services/supplier/fetch-many-supplier-by-social-name.ts:19:37
     async execute({ socialName }: FetchManySupplierBySocialNameServiceRequest): Promise<FetchManySupplierBySocialNameServiceResponse> {
         const suppliers = await this.supplierRepository.findManyBySocialName(socialName);
 
-        if (suppliers.length === 0) {
-            throw new NoRecordsFoundError();
-        }
+        if (suppliers.length === 0) {}
 
         return {
killedBy: FetchManySupplierBySocialNameService execute should throw NoRecordsFoundError when no suppliers match the social name
statusReason: promise resolved "{ suppliers: [] }" instead of rejecting
