[Killed] BlockStatement
src/services/supplier/find-supplier-by-id.ts:16:109
 export class FindSupplierByIdService {
     constructor(private supplierRepository: SupplierRepository) {}
 
-    async execute({ supplierId }: FindSupplierByIdServiceRequest): Promise<FindSupplierByIdServiceResponse> {
-        const supplier = await this.supplierRepository.findById(supplierId);
-
-        if (!supplier) {
-            throw new NoRecordsFoundError();
-        }
-
-        return {
-            supplier
-        };
-    }
+    async execute({ supplierId }: FindSupplierByIdServiceRequest): Promise<FindSupplierByIdServiceResponse> {}
 }
 
killedBy: FindSupplierByIdService execute should return a supplier by id successfully
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/services/supplier/find-supplier-by-id.ts:19:13
     async execute({ supplierId }: FindSupplierByIdServiceRequest): Promise<FindSupplierByIdServiceResponse> {
         const supplier = await this.supplierRepository.findById(supplierId);
 
-        if (!supplier) {
+        if (false) {
             throw new NoRecordsFoundError();
         }
killedBy: FindSupplierByIdService execute should throw NoRecordsFoundError when supplier does not exist
statusReason: promise resolved "{ supplier: null }" instead of rejecting
