[Killed] BlockStatement
src/services/supplier/patch-supplier.ts:22:100
 export class PatchSupplierService {
     constructor(private supplierRepository: SupplierRepository) { }
 
-    async handle({ id, data }: PatchSupplierServiceRequest): Promise<PatchSupplierServiceResponse> {
-        const supplierExists = await this.supplierRepository.findById(id);
-
-        if (!supplierExists) {
-            throw new NoRecordsFoundError;
-        }
-
-        const supplier = await this.supplierRepository.patch(id, data);
-
-        return {
-            supplier
-        };
-    }
+    async handle({ id, data }: PatchSupplierServiceRequest): Promise<PatchSupplierServiceResponse> {}
 }
 
killedBy: PatchSupplierService handle should update supplier partial data successfully
statusReason: expected "spy" to be called with arguments: [ '1' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/services/supplier/patch-supplier.ts:25:13
     async handle({ id, data }: PatchSupplierServiceRequest): Promise<PatchSupplierServiceResponse> {
         const supplierExists = await this.supplierRepository.findById(id);
 
-        if (!supplierExists) {
+        if (true) {
             throw new NoRecordsFoundError;
         }
killedBy: PatchSupplierService handle should update supplier partial data successfully
statusReason: No records found.

[Killed] BooleanLiteral
src/services/supplier/patch-supplier.ts:25:13
     async handle({ id, data }: PatchSupplierServiceRequest): Promise<PatchSupplierServiceResponse> {
         const supplierExists = await this.supplierRepository.findById(id);
 
-        if (!supplierExists) {
+        if (supplierExists) {
             throw new NoRecordsFoundError;
         }
killedBy: PatchSupplierService handle should update supplier partial data successfully
statusReason: No records found.
