[Killed] BlockStatement
src/services/user/delete-user.ts:17:87
     private userRepository: UserRepository
   ) {}
 
-  async execute({ id }: DeleteUserServiceRequest): Promise<DeleteUserServiceResponse> {
-    const user = await this.userRepository.delete(id);
-
-    return {
-      user,
-    };
-  }
+  async execute({ id }: DeleteUserServiceRequest): Promise<DeleteUserServiceResponse> {}
 }
 
killedBy: DeleteUserService execute should delete a user successfully
statusReason: expected "spy" to be called 1 times, but got 0 times
