[Killed] BlockStatement
src/services/user/get-all-users.ts:11:56
 export class GetAllUsersService {
   constructor(private userRepository: UserRepository) {}
 
-  async execute(): Promise<GetAllUsersServiceResponse> {
-    const users = await this.userRepository.findMany();
-
-    return {
-      users
-    };
-  }
+  async execute(): Promise<GetAllUsersServiceResponse> {}
 }
killedBy: GetAllUsersService execute should return all users successfully
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/services/user/get-all-users.ts:14:12
   async execute(): Promise<GetAllUsersServiceResponse> {
     const users = await this.userRepository.findMany();
 
-    return {
-      users
-    };
+    return {};
   }
 }
killedBy: GetAllUsersService execute should return all users successfully
statusReason: expected undefined to deeply equal [ Array(2) ]
