[Killed] BlockStatement
src/services/user/get-user-by-id.ts:18:93
       private userRepository: UserRepository
   ) {}
 
-  async execute({ userId }: GetUserByIdServiceRequest): Promise<GetUserByIdServiceResponse> {
-      const user = await this.userRepository.findById(userId)
-
-      if (!user) {
-          throw new ResourceNotFoundError()
-      }
-
-      return {
-          user
-      }
-  }
+  async execute({ userId }: GetUserByIdServiceRequest): Promise<GetUserByIdServiceResponse> {}
 }
killedBy: GetUserByIdService execute should return a user by id successfully
statusReason: expected "spy" to be called 1 times, but got 0 times
