[Killed] BlockStatement
src/services/user/get-user-profile.ts:18:99
       private userRepository: UserRepository
   ) {}
 
-  async execute({ userId }: GetUserProfileServiceRequest): Promise<GetUserProfileServiceResponse> {
-      const user = await this.userRepository.findById(userId)
-
-      if (!user) {
-          throw new ResourceNotFoundError()
-      }
-
-      return {
-          user
-      }
-  }
+  async execute({ userId }: GetUserProfileServiceRequest): Promise<GetUserProfileServiceResponse> {}
 }
killedBy: GetUserProfileService execute should return user profile successfully
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/services/user/get-user-profile.ts:21:18
   async execute({ userId }: GetUserProfileServiceRequest): Promise<GetUserProfileServiceResponse> {
       const user = await this.userRepository.findById(userId)
 
-      if (!user) {
-          throw new ResourceNotFoundError()
-      }
+      if (!user) {}
 
       return {
killedBy: GetUserProfileService execute should throw ResourceNotFoundError when user does not exist
statusReason: promise resolved "{ user: null }" instead of rejecting
